{
  "version": 1,
  "facts": {
    "protagonist": {
      "name": "Priya Verma",
      "preferred_name": "Priya",
      "age": 22,
      "pronouns": "she/her",
      "country": "India",
      "state": "Uttar Pradesh",
      "district": "Lucknow",
      "town": "Mohanlalganj",
      "settlement_type": "peri-urban (outskirts of Lucknow)",
      "timezone": "Asia/Kolkata",
      "languages": [
        "Hindi",
        "English (functional)"
      ],
      "document_habits": {
        "plastic_folder": "Keeps academic documents (admit cards, marksheets, photos) in a plastic folder and treats it protectively.",
        "checklists": "Uses a squared-page notebook to convert worry into written checklists."
      }
    },
    "household": {
      "household_size_target": 4,
      "home_notes": "Brick house with small courtyard; hand pump nearby; neem tree; occasional power cuts; unreliable inverter.",
      "members": [
        {
          "role": "father",
          "name": "Rakesh Verma",
          "notes": "Practical, quiet pride, anxious about money; small farming (seasonal crops + some vegetables) and part-time warehouse associate work (sorting/packing/loading) on the Lucknow side. Usually ~3 night shifts a week; fewer shifts during harvest; more shifts in festive seasons when demand and parcel volume spike."
        },
        {
          "role": "mother",
          "name": "Sunita Verma",
          "notes": "Warm, observant; runs household; manages small household economics."
        },
        {
          "role": "brother",
          "name": "Arjun Verma",
          "age": 16,
          "notes": "Clever, a little lazy on purpose, quietly loyal. They bicker, but help each other in small, careful ways."
        }
      ]
    },
    "recurring_places": [
      {
        "name": "Bus stand",
        "notes": "Crossroads place; shared autos, buses; recurring ambient scene."
      },
      {
        "name": "Chai stall",
        "notes": "Near the bus stand; morning punctuation; gossip-lite."
      },
      {
        "name": "Cyber/photocopy shop",
        "notes": "Forms, IDs, printouts; small friction generator."
      },
      {
        "name": "Market lane",
        "notes": "Vegetables, stationery, small errands; evening walk loop."
      }
    ],
    "recurring_characters": [
      {
        "name": "Chai Uncle",
        "role": "tea stall owner",
        "notes": "Friendly; remembers preferences; says more with tone than words."
      },
      {
        "name": "Sharma Ji",
        "role": "photocopy/stationery/cyber cafe",
        "notes": "Moody but helpful if you catch him right; knows every form requirement."
      },
      {
        "name": "Sana",
        "role": "Priya's close friend",
        "age": 22,
        "notes": "Quick laugh; practical; says things out loud; part-time work."
      },
      {
        "name": "Irfan",
        "role": "old school friend",
        "age": 22,
        "notes": "Gentle; helps with forms/cyber-cafe things; friendship is easy but not simple."
      }
    ]
  },
  "open_threads": [
    {
      "id": "education_continuation",
      "status": "open",
      "notes": "BA (distance/local college) continues intermittently; fees/attendance stress; admit cards kept carefully. On Jan 3 she pays the fee and submits/uploads the paperwork via Sharma Ji; acknowledgement printed (awaiting confirmation). On Jan 4 she tries checking status at Sharma Ji’s shop; the portal is slow on Sunday, so she prints an extra acknowledgement copy as backup; confirmation still pending. On Jan 5 she checks again and sees status: ‘Payment received. Application under review.’ She prints this status as proof. On Jan 14 (Makar Sankranti), she receives a portal update: ‘Approved’ with instruction to download a confirmation slip. On Jan 15 she downloads and prints two copies of the confirmation slip at Sharma Ji’s shop and files them in her plastic folder."
    },
    {
      "id": "keyboard_home_practice",
      "status": "open",
      "notes": "On Jan 11 Priya starts a ‘KEYBOARD’ fund after spotting a second-hand keyboard priced at ₹250. She reaches ₹250 on Jan 14. On Jan 15 she buys the second-hand USB keyboard for ₹250 and begins at-home practice (even without a screen), focusing on home-row anchor bumps and muscle memory. On Jan 16 she buys an OTG (on-the-go) adapter for ₹60 from Sharma Ji to connect the keyboard to her phone, enabling practice with visual feedback on-screen; she begins doing 15-minute at-home sessions using a typing practice site and starts sending typed messages (instead of voice notes) to Sana."
    },
    {
      "id": "typing_practice",
      "status": "open",
      "notes": "On Jan 5, noticing the F/J home-row bumps on Sharma Ji’s keyboard nudges Priya into asking how to learn typing. Sharma Ji offers to show her when the shop is empty; Priya plans short practice sessions (15 minutes, three days a week) as a step toward steadier work. On Jan 6 she completes her first 15-minute session focused on home-row drills (A-S-D-F / J-K-L-;) and keeps a printed practice sheet in her plastic folder. On Jan 7 she returns for Day 2 (15 minutes) and begins simple pattern drills (as/df and jk/kl); Sharma Ji scribbles the patterns on scrap paper for her to practice at home. On Jan 8 she completes Day 3 (15 minutes) despite a crowded Thursday shop; Sharma Ji has her type her name (‘Priya Verma’) and assigns a small home routine (name repetitions plus as/df and jk/kl patterns). On Jan 9, during a cold-wave school closure, Priya comes in just to practice and ends up typing a handwritten list cleanly for a customer; Sharma Ji pays her ₹50 and says he’ll call if more typing work comes. On Jan 10, under very dense fog warnings, Priya practises again (15 minutes) and types a Hindi complaint letter for an uncle for the electricity office; Sharma Ji pays her ₹60 and warns her to be careful with people’s names and words. On Jan 11 she sneaks in a short Sunday practice, asks about buying a keyboard for home practice, spots a second-hand keyboard for ₹250, and starts a small ‘KEYBOARD’ fund with ₹50. On Jan 12, Priya types a Vivekananda quote for Arjun’s National Youth Day chart and carefully types another Hindi list for a customer; Sharma Ji pays her ₹70. She adds it to her KEYBOARD fund, bringing it to ₹120. On Jan 13 she earns ₹50 typing a distribution list, taking the fund to ₹170. On Jan 14 (Makar Sankranti) she does a quick urgent job and earns ₹80, reaching ₹250—enough to buy the second-hand keyboard for home practice after the festival."
    },
    {
      "id": "money_rhythm",
      "status": "open",
      "notes": "Income is uneven (tutoring/odd work). Wants more stability without leaving home abruptly."
    },
    {
      "id": "city_pull",
      "status": "open",
      "notes": "Lucknow is close enough to matter; occasional trips for forms/exams/hospitals/errands."
    },
    {
      "id": "marriage_pressure_background",
      "status": "open",
      "notes": "Low-simmer family/community expectations; keep subtle and non-melodramatic."
    }
  ]
}
