{
  "version": 1,
  "facts": {
    "protagonist": {
      "name": "Priya Verma",
      "preferred_name": "Priya",
      "age": 22,
      "pronouns": "she/her",
      "country": "India",
      "state": "Uttar Pradesh",
      "district": "Lucknow",
      "town": "Mohanlalganj",
      "settlement_type": "peri-urban (outskirts of Lucknow)",
      "timezone": "Asia/Kolkata",
      "languages": [
        "Hindi",
        "English (functional)"
      ],
      "document_habits": {
        "plastic_folder": "Keeps academic documents (admit cards, marksheets, photos) in a plastic folder and treats it protectively.",
        "checklists": "Uses a squared-page notebook to convert worry into written checklists."
      },
      "digital_habits": {
        "email_account": "With Sharma Ji’s help, Priya creates her first email account on Jan 24 to complete a PAN application and notes the password carefully.",
        "alarms": "On Jan 25, before her first regular clinic day, Priya starts setting two alarms (7:30 and 7:45) as a practical way to reach on time.",
        "link_caution": "On Jan 28, after receiving an official-looking PAN email, Priya avoids clicking unknown links and chooses to verify the message with Sharma Ji.",
        "attachment_learning": "On Jan 29, Priya learns the ‘paperclip’ icon means an email attachment (‘paper that travels’) and has Sharma Ji open/print it for safety.",
        "pan_allotted": "On Feb 3, Priya’s PAN is allotted; she prints her e-PAN at Sharma Ji’s shop, makes photocopies for her file, and keeps the number private (not shared by message).",
        "pan_submitted_to_clinic": "On Feb 4, Priya submits a PAN photocopy and her PAN number to the canal-road clinic for her staff file, and signs the staff sheet."
      }
    },
    "household": {
      "household_size_target": 4,
      "home_notes": "Brick house with small courtyard; hand pump nearby; neem tree; occasional power cuts; unreliable inverter.",
      "members": [
        {
          "role": "father",
          "name": "Rakesh Verma",
          "notes": "Practical, quiet pride, anxious about money; small farming (seasonal crops + some vegetables) and part-time warehouse associate work (sorting/packing/loading) on the Lucknow side. Usually ~3 night shifts a week; fewer shifts during harvest; more shifts in festive seasons when demand and parcel volume spike."
        },
        {
          "role": "mother",
          "name": "Sunita Verma",
          "notes": "Warm, observant; runs household; manages small household economics."
        },
        {
          "role": "brother",
          "name": "Arjun Verma",
          "age": 16,
          "notes": "Clever, a little lazy on purpose, quietly loyal. They bicker, but help each other in small, careful ways."
        }
      ]
    },
    "recurring_places": [
      {
        "name": "Bus stand",
        "notes": "Crossroads place; shared autos, buses; recurring ambient scene."
      },
      {
        "name": "Chai stall",
        "notes": "Near the bus stand; morning punctuation; gossip-lite."
      },
      {
        "name": "Cyber/photocopy shop",
        "notes": "Forms, IDs, printouts; small friction generator."
      },
      {
        "name": "Market lane",
        "notes": "Vegetables, stationery, small errands; evening walk loop."
      }
    ],
    "recurring_characters": [
      {
        "name": "Chai Uncle",
        "role": "tea stall owner",
        "notes": "Friendly; remembers preferences; says more with tone than words."
      },
      {
        "name": "Sharma Ji",
        "role": "photocopy/stationery/cyber cafe",
        "notes": "Moody but helpful if you catch him right; knows every form requirement."
      },
      {
        "name": "Sana",
        "role": "Priya's close friend",
        "age": 22,
        "notes": "Quick laugh; practical; says things out loud; part-time work."
      },
      {
        "name": "Irfan",
        "role": "old school friend",
        "age": 22,
        "notes": "Gentle; helps with forms/cyber-cafe things; friendship is easy but not simple."
      },
      {
        "name": "Clinic desk woman (unnamed)",
        "role": "clinic receptionist/registration",
        "notes": "Brisk, competent; tests applicants by having them fill real registration forms; corrects pin codes without fuss."
      }
    ]
  },
  "open_threads": [
    {
      "id": "education_continuation",
      "status": "open",
      "notes": "BA (distance/local college) continues intermittently; fees/attendance stress; admit cards kept carefully. On Jan 3 she pays the fee and submits/uploads the paperwork via Sharma Ji; acknowledgement printed (awaiting confirmation). On Jan 4 she tries checking status at Sharma Ji’s shop; the portal is slow on Sunday, so she prints an extra acknowledgement copy as backup; confirmation still pending. On Jan 5 she checks again and sees status: ‘Payment received. Application under review.’ She prints this status as proof. On Jan 14 (Makar Sankranti), she receives a portal update: ‘Approved’ with instruction to download a confirmation slip. On Jan 15 she downloads and prints two copies of the confirmation slip at Sharma Ji’s shop and files them in her plastic folder. By Jan 30, as clinic work becomes daily, Sana nudges Priya not to drop studying; Sharma Ji suggests using Sunday for Priya’s own tasks (including downloading syllabus/material). On Feb 1, Priya keeps a protected one-hour reading block (11–12), underlines unfamiliar words, and sends Sana a photo as proof."
    },
    {
      "id": "keyboard_home_practice",
      "status": "open",
      "notes": "On Jan 11 Priya starts a ‘KEYBOARD’ fund after spotting a second-hand keyboard priced at ₹250. She reaches ₹250 on Jan 14. On Jan 15 she buys the second-hand USB keyboard for ₹250 and begins at-home practice (even without a screen), focusing on home-row anchor bumps and muscle memory. On Jan 16 she buys an OTG (on-the-go) adapter for ₹60 from Sharma Ji to connect the keyboard to her phone, enabling practice with visual feedback on-screen; she begins doing 15-minute at-home sessions using a typing practice site and starts sending typed messages (instead of voice notes) to Sana. On Jan 17 she discovers the setup works on Rakesh’s phone too and uses it to type a clear message to his warehouse supervisor about fog delays, receiving a thumbs-up reply that feels like proof."
    },
    {
      "id": "typing_practice",
      "status": "open",
      "notes": "On Jan 5, noticing the F/J home-row bumps on Sharma Ji’s keyboard nudges Priya into asking how to learn typing. Sharma Ji offers to show her when the shop is empty; Priya plans short practice sessions (15 minutes, three days a week) as a step toward steadier work. On Jan 6 she completes her first 15-minute session focused on home-row drills (A-S-D-F / J-K-L-;) and keeps a printed practice sheet in her plastic folder. On Jan 7 she returns for Day 2 (15 minutes) and begins simple pattern drills (as/df and jk/kl); Sharma Ji scribbles the patterns on scrap paper for her to practice at home. On Jan 8 she completes Day 3 (15 minutes) despite a crowded Thursday shop; Sharma Ji has her type her name (‘Priya Verma’) and assigns a small home routine (name repetitions plus as/df and jk/kl patterns). On Jan 9, during a cold-wave school closure, Priya comes in just to practice and ends up typing a handwritten list cleanly for a customer; Sharma Ji pays her ₹50 and says he’ll call if more typing work comes. On Jan 10, under very dense fog warnings, Priya practises again (15 minutes) and types a Hindi complaint letter for an uncle for the electricity office; Sharma Ji pays her ₹60 and warns her to be careful with people’s names and words. On Jan 11 she sneaks in a short Sunday practice, asks about buying a keyboard for home practice, spots a second-hand keyboard for ₹250, and starts a small ‘KEYBOARD’ fund with ₹50. On Jan 12, Priya types a Vivekananda quote for Arjun’s National Youth Day chart and carefully types another Hindi list for a customer; Sharma Ji pays her ₹70. She adds it to her KEYBOARD fund, bringing it to ₹120. On Jan 13 she earns ₹50 typing a distribution list, taking the fund to ₹170. On Jan 14 (Makar Sankranti) she does a quick urgent job and earns ₹80, reaching ₹250—enough to buy the second-hand keyboard for home practice after the festival. On Jan 18, Priya types a ration shop list in Hindi at Sharma Ji’s shop and earns ₹70; she also starts making typed phone-notes lists (groceries) as part of her daily system."
    },
    {
      "id": "clinic_operator_opportunity",
      "status": "open",
      "notes": "On Jan 18, Priya photographs a torn market-lane notice advertising a ‘computer operator’ role (typing + basic form filling). Sharma Ji says it is likely for a small clinic near canal road that repeatedly hires for printing/form work, and offers Priya a one-page typing + basic form-filling practice/test on Jan 19 to prepare before she approaches them. On Jan 19, Sharma Ji runs the practice: Priya types a full page (catching and correcting small mistakes like missing words and ‘from/form’), then fills a sample patient registration form from a handwritten slip. Sharma Ji emphasizes that she must never guess unclear details (especially phone numbers) and should ask people to repeat. He advises her to visit the clinic, ask directly if the vacancy is real, and treat rejection as ‘come back and practice.’ On Jan 20, Priya goes to the clinic and is tested immediately by filling a real patient registration form; she asks for unclear digits to be repeated and requests a pin code rather than guessing. The clinic desk woman offers her a half-day trial shift at 10am the next day. On Jan 21, Priya completes the first half-day trial, learns to handle basic printing (including clearing a paper jam), keeps asking for clarity on numbers, and is asked to return again at 10am with an extra Aadhaar copy and passport photos; she is given ₹200 as travel/trial money. On Jan 22, Priya returns for the second half-day trial, submits passport photos and an extra Aadhaar copy, fills a one-page staff-details form with her own information (her passport photo stapled to it), is asked about PAN (told to make it later), continues registration work, and is told to return again at 10am; she receives ₹200 again. On Jan 23 (Vasant Panchami), Priya works another half-day; the desk woman tells her to start coming daily from Monday (10am–2pm), says pay will be decided, and asks her to apply for a PAN card and bring the receipt next week; Priya receives ₹300 for the day. On Jan 24, Priya applies for PAN at Sharma Ji’s shop, creates an email account for the process, completes payment, and prints the acknowledgement receipt as proof to bring to the clinic next week. On Jan 26 (Republic Day), Priya reports to the clinic anyway; despite a holiday note taped to the shutter, the desk woman opens and puts her to work. Priya receives ₹300 again and is told to come tomorrow. On Jan 27, Priya works a busier normal day at the clinic; the desk woman states that for now Priya will be paid ₹300 per day for the 10am–2pm shift and reminds her again to bring the PAN acknowledgement receipt next week. On Jan 28, Priya shows the receipt at the clinic; the desk woman asks her to bring a photocopy for the staff file, and Priya gets one made at Sharma Ji’s shop. On Jan 29, the clinic begins a simple staff file for Priya (a cardboard file cover and a new drawer slot), and Priya brings another PAN-related email to Sharma Ji and learns about email attachments (‘paperclip’). On Jan 30, the desk woman asks again for an extra passport photo for the file; Priya gets fresh passport photos made near the market lane and stores them carefully in her folder to bring to the clinic. On Feb 3, the desk woman asks for the PAN number; Priya checks with Sharma Ji, learns her PAN is allotted, and prints the e-PAN to bring to the clinic. On Feb 4, Priya submits a PAN photocopy and the PAN number to the clinic staff file and signs the staff sheet."
    },
    {
      "id": "money_rhythm",
      "status": "open",
      "notes": "Income is uneven (tutoring/odd work). Wants more stability without leaving home abruptly."
    },
    {
      "id": "city_pull",
      "status": "open",
      "notes": "Lucknow is close enough to matter; occasional trips for forms/exams/hospitals/errands."
    },
    {
      "id": "marriage_pressure_background",
      "status": "open",
      "notes": "Low-simmer family/community expectations; keep subtle and non-melodramatic."
    }
  ]
}
