{"date":"2026-01-01","day_num":1,"title":"The Fog and the Milk Run","events":["On a dense, cold New Year morning in Mohanlalganj, Priya steps out to buy two milk packets.","UPI payment fails due to network; she pays cash from a folded stash in her notebook.","She warms her hands at Chai Uncle’s stall, exchanges small New Year wishes, and brings chai home.","A voice note from Sana reminds her the BA form deadline is near, stirring the familiar paperwork/fees knot.","Rakesh returns from a night warehouse shift; the household automatically softens its volume and settles around hot tea."],"facts_introduced":["Priya keeps a squared-page notebook for lists/planning and tucks emergency cash inside a separate notebook.","Morning fog in early January strongly shapes the lane’s sounds and distances.","Network/UPI unreliability is a routine friction point in Priya’s errands.","Sana is actively monitoring deadlines and nudges Priya about college forms.","Priya habitually sets aside tea for her father when he returns from night shifts.","Arjun’s New Year greeting is lazy but sincere; household affection is understated."],"open_hooks":["Will Priya manage the BA form/fee/print requirements before the deadline?","A small arc of Priya seeking more stability may begin with this paperwork step."],"recap":"On the first morning of 2026, Priya walks through thick winter fog to buy milk, pauses for ginger chai, and returns to a house waking in layers. A failed UPI payment and Sana’s urgent voice note about college forms add small, familiar pressure, but the day ends with the quiet relief of Rakesh coming home from a night shift and everyone settling around tea."}
{"date":"2026-01-02","day_num":2,"title":"The Photocopy File","events":["Priya decides not to delay and heads out to get her BA form documents printed and photocopied.","She stops for chai; Chai Uncle nudges her to go early before the shop gets crowded and cranky.","At Sharma Ji’s cyber/photocopy shop, slow network, a moody printer, and a brief flicker of power cut stretch a simple task.","Irfan appears to print a ticket; they share quiet company while waiting.","Priya gets fresh photos taken nearby, returns to staple/attach documents, and comes home with the packet organized.","Rakesh signs where needed and says he’ll arrange the fee money after the next shift; Priya updates her checklist."],"facts_introduced":["Priya keeps her academic documents in a plastic folder and treats it with careful, almost protective attention.","Sharma Ji’s shop can be slowed by patchy network, minor power flickers, and a temperamental printer.","A small photo studio near the market lane can produce fresh passport photos quickly for forms.","Irfan occasionally uses the cyber shop for practical errands (printing tickets) and is a calm presence.","Rakesh is willing to sign required declarations and plans to arrange the BA fee after an upcoming shift.","Priya manages anxiety by turning tasks into written checklists in her squared-page notebook."],"open_hooks":["Will Priya be able to pay the fee and submit the BA form on time?","Will the renewed push to continue her BA lead to steadier work or new responsibilities?"],"recap":"On January 2, Priya turns Sana’s deadline warning into action, trekking through the waking market lane for photocopies, printouts, and fresh photos. A slow network and a fussy printer stretch her patience, but shared small talk and quiet company make the wait feel lighter. She returns home with the papers in order, gets Rakesh’s signature, and ends the day with a shorter, clearer list."}
{"date":"2026-01-03","day_num":3,"title":"The Stamp and the Token","events":["Rakesh returns from his night shift and quietly leaves money for Priya’s BA form fee; Sunita urges her to go on the first Saturday while the bank is open.","Priya tucks the cash in an envelope, carries her plastic folder and checklist notebook, and stops for ginger chai before the queue.","At the Mohanlalganj bank, she joins the first-Saturday line, gets token 27 from the guard, and waits through the slow choreography of counters and beeps.","She deposits the fee in cash and receives a purple-stamped receipt, which immediately relieves her tight, waiting anxiety.","Priya takes the stamped receipt to Sharma Ji, who uploads the submission (slow network, as always) and prints an acknowledgement.","Back home, Priya files the receipt safely, ticks ‘Fee paid + receipt’ in her notebook, and leaves tea by Rakesh’s bed as the day settles."],"facts_introduced":["On Jan 3, Priya successfully pays the BA fee at the local bank and gets a stamped receipt.","The bank uses a token system (Priya receives token 27) and feels crowded on the first Saturday.","A stamped receipt functions like emotional proof—relief through paperwork.","Sharma Ji can upload submissions and print acknowledgements for college forms when provided proof of payment.","Priya keeps fee receipts and acknowledgements together in the plastic folder, stored on the shelf above the trunk.","Priya expresses care through small acts (leaving tea for her sleeping father rather than waking him)."],"open_hooks":["Will Priya receive a confirmation/next step from the college after submission?","Will the push to continue her BA translate into a steadier routine (or new financial strain) for the family?"],"recap":"On January 3, the BA form stops being an anxious future task and becomes a morning of queues, tokens, and paperwork. Rakesh’s quiet support and Sunita’s practical urgency send Priya to the bank on the first Saturday, where token 27 and a purple stamp finally turn effort into proof. With the receipt uploaded and an acknowledgement printed at Sharma Ji’s shop, she returns home to file everything safely, tick a neat checkbox, and let the day end in the soft relief of something properly done."}
{"date":"2026-01-04","day_num":4,"title":"Raised Dots","events":["On a quiet Sunday morning, Priya waits for a pending portal confirmation after yesterday’s BA fee submission and tries not to refresh her phone too often.","She goes to Sharma Ji’s cyber shop to check application status, but the site is slow and uncooperative; she prints an extra acknowledgement page as backup proof.","A small ‘World Braille Day — Jan 4’ poster in the shop leads Priya into a conversation with Irfan about reading raised dots with fingertips.","At the chemist she notices Braille on a cough lozenge box and, at home, shows the raised dots to Sunita and Arjun; Rakesh offers a quiet line about ‘many alphabets.’","As evening fog returns, Priya adds a next-step note in her squared notebook—wait a day or two, then ask for help if confirmation doesn’t come—and files the papers back on the shelf."],"facts_introduced":["Jan 4 is a slower Sunday with winter sun and returning evening fog in Mohanlalganj.","The college portal can be sluggish/unresponsive on Sunday; Priya cannot get a fresh confirmation yet.","Priya prints and keeps an extra copy of the submission acknowledgement as a backup.","A ‘World Braille Day — Jan 4’ poster appears in Sharma Ji’s shop, prompting Priya’s first focused curiosity about Braille.","Priya notices Braille (raised dots) on medicine packaging at the chemist and shares the tactile detail with her family.","Priya plans follow-up pragmatically: if no confirmation by Tuesday, she will ask Sharma Ji to help check/call."],"open_hooks":["When will Priya receive official confirmation/next steps for her BA submission?","Will Priya’s growing attention to ‘codes’ and systems (forms, networks, Braille) nudge her toward learning something new for stability?"],"recap":"January 4 moves at Sunday pace: Priya tries to see a final ‘confirmed’ message, but the portal refuses to cooperate. At Sharma Ji’s shop she settles for an extra printed acknowledgement, then discovers World Braille Day through a poster and the tiny raised dots on a medicine box. By evening, she files her papers, writes a simple follow-up plan, and lets the day end in fog and small, tactile proof."}
{"date":"2026-01-05","day_num":5,"title":"Home Row","events":["On a cold Monday morning, Priya goes to Sharma Ji’s cyber shop to check her BA submission status.","The portal finally shows ‘Payment received. Application under review.’; Priya prints the status page as fresh proof.","Priya notices the raised bumps on the F and J keys and learns they mark the ‘home row’ for touch typing.","Irfan encourages her; Sharma Ji grudgingly offers to show her basic typing when the shop is empty.","At home, Priya writes a small plan: practice typing for fifteen minutes, three days this week, alongside waiting for final confirmation.","Rakesh leaves for his warehouse shift in the evening; Priya sends him off with tea and the quiet news that she wants to learn."],"facts_introduced":["On Jan 5, Priya sees her BA application status update to ‘Payment received. Application under review.’","Priya prints the status page as an additional piece of proof, alongside her receipt and acknowledgement.","Priya notices the tactile bumps on the F and J keys and learns they anchor touch typing’s home-row position.","Sharma Ji is willing to teach Priya basic typing in short sessions when the shop is not busy.","Priya makes a concrete weekly plan for typing practice (15 minutes, three days a week).","Priya is beginning to connect tactile ‘codes’ (Braille, keyboard markers) with possibilities for steadier work."],"open_hooks":["When will Priya receive the final ‘confirmed’ message and next steps from the college?","Will Priya’s typing practice become a real skill that changes her work options and daily routine?"],"recap":"On January 5, Priya’s waiting turns into something she can hold: the portal finally shows her fee is received and her application is under review, and she prints the line as proof. In Sharma Ji’s shop, two tiny bumps on a keyboard lead her to the idea of touch typing—another way of reading and writing with fingertips. By evening she has not received the final confirmation, but she has made a small plan, and that feels like steadier ground."}
{"date": "2026-01-06", "day_num": 6, "title": "Fifteen Minutes", "events": ["On a foggy Tuesday morning after Rakesh returns from a night shift, the household slips into its quiet rhythm while tea is made.", "Priya times her visit to Sharma Ji’s shop for when it’s half-open and not crowded, going for her promised first typing lesson.", "Sharma Ji drills her on the home row (A-S-D-F / J-K-L-;) and insists she keep her eyes on the screen; Priya learns to use backspace and to keep going through mistakes.", "Sharma Ji gives her a small home-row practice printout; Priya buys coriander on the way back.", "A short power cut in the afternoon turns the house still; Priya ‘practises’ on her thigh with the printed sheet.", "In the evening she ticks ‘Typing practice: Day 1 (15 minutes)’ in her notebook and checks the portal once—still under review, but it feels less tight."], "facts_introduced": ["On Jan 6, Priya completes her first official typing practice session: 15 minutes at Sharma Ji’s shop.", "Sharma Ji uses a simple home-row drill (A-S-D-F and J-K-L-;) and insists on not looking at the keyboard.", "Priya learns to treat mistakes as normal and uses the backspace key as part of practice.", "Sharma Ji provides a small printed ‘Home Row Practice’ sheet for at-home drills.", "A brief daytime power cut (about twenty minutes) is normal enough to be routine.", "Priya stores the typing practice sheet inside her plastic folder, treating the new skill like a document worth protecting.", "Priya begins checking the college portal less compulsively; the status remains ‘under review.’"], "open_hooks": ["When will Priya receive final confirmation/next steps for the BA application?", "Will she follow through on her plan to practise typing three days this week—and will it start changing her work options?"], "recap": "On January 6, Priya gives herself a new kind of proof: fifteen minutes of typing practice at Sharma Ji’s shop. The day is ordinary—fog, tea, a brief power cut—but her small tick in the notebook feels like forward motion even while the college portal stays ‘under review.’"}
