{"date": "2026-01-01", "day_num": 1, "title": "The Fog and the Milk Run", "events": ["On a dense, cold New Year morning in Mohanlalganj, Priya steps out to buy two milk packets.", "UPI payment fails due to network; she pays cash from a folded stash in her notebook.", "She warms her hands at Chai Uncle’s stall, exchanges small New Year wishes, and brings chai home.", "A voice note from Sana reminds her the BA form deadline is near, stirring the familiar paperwork/fees knot.", "Rakesh returns from a night warehouse shift; the household automatically softens its volume and settles around hot tea."], "facts_introduced": ["Priya keeps a squared-page notebook for lists/planning and tucks emergency cash inside a separate notebook.", "Morning fog in early January strongly shapes the lane’s sounds and distances.", "Network/UPI unreliability is a routine friction point in Priya’s errands.", "Sana is actively monitoring deadlines and nudges Priya about college forms.", "Priya habitually sets aside tea for her father when he returns from night shifts.", "Arjun’s New Year greeting is lazy but sincere; household affection is understated."], "open_hooks": ["Will Priya manage the BA form/fee/print requirements before the deadline?", "A small arc of Priya seeking more stability may begin with this paperwork step."], "recap": "On the first morning of 2026, Priya walks through thick winter fog to buy milk, pauses for ginger chai, and returns to a house waking in layers. A failed UPI payment and Sana’s urgent voice note about college forms add small, familiar pressure, but the day ends with the quiet relief of Rakesh coming home from a night shift and everyone settling around tea."}
{"date": "2026-01-02", "day_num": 2, "title": "The Photocopy File", "events": ["Priya decides not to delay and heads out to get her BA form documents printed and photocopied.", "She stops for chai; Chai Uncle nudges her to go early before the shop gets crowded and cranky.", "At Sharma Ji’s cyber/photocopy shop, slow network, a moody printer, and a brief flicker of power cut stretch a simple task.", "Irfan appears to print a ticket; they share quiet company while waiting.", "Priya gets fresh photos taken nearby, returns to staple/attach documents, and comes home with the packet organized.", "Rakesh signs where needed and says he’ll arrange the fee money after the next shift; Priya updates her checklist."], "facts_introduced": ["Priya keeps her academic documents in a plastic folder and treats it with careful, almost protective attention.", "Sharma Ji’s shop can be slowed by patchy network, minor power flickers, and a temperamental printer.", "A small photo studio near the market lane can produce fresh passport photos quickly for forms.", "Irfan occasionally uses the cyber shop for practical errands (printing tickets) and is a calm presence.", "Rakesh is willing to sign required declarations and plans to arrange the BA fee after an upcoming shift.", "Priya manages anxiety by turning tasks into written checklists in her squared-page notebook."], "open_hooks": ["Will Priya be able to pay the fee and submit the BA form on time?", "Will the renewed push to continue her BA lead to steadier work or new responsibilities?"], "recap": "On January 2, Priya turns Sana’s deadline warning into action, trekking through the waking market lane for photocopies, printouts, and fresh photos. A slow network and a fussy printer stretch her patience, but shared small talk and quiet company make the wait feel lighter. She returns home with the papers in order, gets Rakesh’s signature, and ends the day with a shorter, clearer list."}
{"date": "2026-01-03", "day_num": 3, "title": "The Stamp and the Token", "events": ["Rakesh returns from his night shift and quietly leaves money for Priya’s BA form fee; Sunita urges her to go on the first Saturday while the bank is open.", "Priya tucks the cash in an envelope, carries her plastic folder and checklist notebook, and stops for ginger chai before the queue.", "At the Mohanlalganj bank, she joins the first-Saturday line, gets token 27 from the guard, and waits through the slow choreography of counters and beeps.", "She deposits the fee in cash and receives a purple-stamped receipt, which immediately relieves her tight, waiting anxiety.", "Priya takes the stamped receipt to Sharma Ji, who uploads the submission (slow network, as always) and prints an acknowledgement.", "Back home, Priya files the receipt safely, ticks ‘Fee paid + receipt’ in her notebook, and leaves tea by Rakesh’s bed as the day settles."], "facts_introduced": ["On Jan 3, Priya successfully pays the BA fee at the local bank and gets a stamped receipt.", "The bank uses a token system (Priya receives token 27) and feels crowded on the first Saturday.", "A stamped receipt functions like emotional proof—relief through paperwork.", "Sharma Ji can upload submissions and print acknowledgements for college forms when provided proof of payment.", "Priya keeps fee receipts and acknowledgements together in the plastic folder, stored on the shelf above the trunk.", "Priya expresses care through small acts (leaving tea for her sleeping father rather than waking him)."], "open_hooks": ["Will Priya receive a confirmation/next step from the college after submission?", "Will the push to continue her BA translate into a steadier routine (or new financial strain) for the family?"], "recap": "On January 3, the BA form stops being an anxious future task and becomes a morning of queues, tokens, and paperwork. Rakesh’s quiet support and Sunita’s practical urgency send Priya to the bank on the first Saturday, where token 27 and a purple stamp finally turn effort into proof. With the receipt uploaded and an acknowledgement printed at Sharma Ji’s shop, she returns home to file everything safely, tick a neat checkbox, and let the day end in the soft relief of something properly done."}
{"date": "2026-01-04", "day_num": 4, "title": "Raised Dots", "events": ["On a quiet Sunday morning, Priya waits for a pending portal confirmation after yesterday’s BA fee submission and tries not to refresh her phone too often.", "She goes to Sharma Ji’s cyber shop to check application status, but the site is slow and uncooperative; she prints an extra acknowledgement page as backup proof.", "A small ‘World Braille Day — Jan 4’ poster in the shop leads Priya into a conversation with Irfan about reading raised dots with fingertips.", "At the chemist she notices Braille on a cough lozenge box and, at home, shows the raised dots to Sunita and Arjun; Rakesh offers a quiet line about ‘many alphabets.’", "As evening fog returns, Priya adds a next-step note in her squared notebook—wait a day or two, then ask for help if confirmation doesn’t come—and files the papers back on the shelf."], "facts_introduced": ["Jan 4 is a slower Sunday with winter sun and returning evening fog in Mohanlalganj.", "The college portal can be sluggish/unresponsive on Sunday; Priya cannot get a fresh confirmation yet.", "Priya prints and keeps an extra copy of the submission acknowledgement as a backup.", "A ‘World Braille Day — Jan 4’ poster appears in Sharma Ji’s shop, prompting Priya’s first focused curiosity about Braille.", "Priya notices Braille (raised dots) on medicine packaging at the chemist and shares the tactile detail with her family.", "Priya plans follow-up pragmatically: if no confirmation by Tuesday, she will ask Sharma Ji to help check/call."], "open_hooks": ["When will Priya receive official confirmation/next steps for her BA submission?", "Will Priya’s growing attention to ‘codes’ and systems (forms, networks, Braille) nudge her toward learning something new for stability?"], "recap": "January 4 moves at Sunday pace: Priya tries to see a final ‘confirmed’ message, but the portal refuses to cooperate. At Sharma Ji’s shop she settles for an extra printed acknowledgement, then discovers World Braille Day through a poster and the tiny raised dots on a medicine box. By evening, she files her papers, writes a simple follow-up plan, and lets the day end in fog and small, tactile proof."}
{"date": "2026-01-05", "day_num": 5, "title": "Home Row", "events": ["On a cold Monday morning, Priya goes to Sharma Ji’s cyber shop to check her BA submission status.", "The portal finally shows ‘Payment received. Application under review.’; Priya prints the status page as fresh proof.", "Priya notices the raised bumps on the F and J keys and learns they mark the ‘home row’ for touch typing.", "Irfan encourages her; Sharma Ji grudgingly offers to show her basic typing when the shop is empty.", "At home, Priya writes a small plan: practice typing for fifteen minutes, three days this week, alongside waiting for final confirmation.", "Rakesh leaves for his warehouse shift in the evening; Priya sends him off with tea and the quiet news that she wants to learn."], "facts_introduced": ["On Jan 5, Priya sees her BA application status update to ‘Payment received. Application under review.’", "Priya prints the status page as an additional piece of proof, alongside her receipt and acknowledgement.", "Priya notices the tactile bumps on the F and J keys and learns they anchor touch typing’s home-row position.", "Sharma Ji is willing to teach Priya basic typing in short sessions when the shop is not busy.", "Priya makes a concrete weekly plan for typing practice (15 minutes, three days a week).", "Priya is beginning to connect tactile ‘codes’ (Braille, keyboard markers) with possibilities for steadier work."], "open_hooks": ["When will Priya receive the final ‘confirmed’ message and next steps from the college?", "Will Priya’s typing practice become a real skill that changes her work options and daily routine?"], "recap": "On January 5, Priya’s waiting turns into something she can hold: the portal finally shows her fee is received and her application is under review, and she prints the line as proof. In Sharma Ji’s shop, two tiny bumps on a keyboard lead her to the idea of touch typing—another way of reading and writing with fingertips. By evening she has not received the final confirmation, but she has made a small plan, and that feels like steadier ground."}
{"date": "2026-01-06", "day_num": 6, "title": "Fifteen Minutes", "events": ["On a foggy Tuesday morning after Rakesh returns from a night shift, the household slips into its quiet rhythm while tea is made.", "Priya times her visit to Sharma Ji’s shop for when it’s half-open and not crowded, going for her promised first typing lesson.", "Sharma Ji drills her on the home row (A-S-D-F / J-K-L-;) and insists she keep her eyes on the screen; Priya learns to use backspace and to keep going through mistakes.", "Sharma Ji gives her a small home-row practice printout; Priya buys coriander on the way back.", "A short power cut in the afternoon turns the house still; Priya ‘practises’ on her thigh with the printed sheet.", "In the evening she ticks ‘Typing practice: Day 1 (15 minutes)’ in her notebook and checks the portal once—still under review, but it feels less tight."], "facts_introduced": ["On Jan 6, Priya completes her first official typing practice session: 15 minutes at Sharma Ji’s shop.", "Sharma Ji uses a simple home-row drill (A-S-D-F and J-K-L-;) and insists on not looking at the keyboard.", "Priya learns to treat mistakes as normal and uses the backspace key as part of practice.", "Sharma Ji provides a small printed ‘Home Row Practice’ sheet for at-home drills.", "A brief daytime power cut (about twenty minutes) is normal enough to be routine.", "Priya stores the typing practice sheet inside her plastic folder, treating the new skill like a document worth protecting.", "Priya begins checking the college portal less compulsively; the status remains ‘under review.’"], "open_hooks": ["When will Priya receive final confirmation/next steps for the BA application?", "Will she follow through on her plan to practise typing three days this week—and will it start changing her work options?"], "recap": "On January 6, Priya gives herself a new kind of proof: fifteen minutes of typing practice at Sharma Ji’s shop. The day is ordinary—fog, tea, a brief power cut—but her small tick in the notebook feels like forward motion even while the college portal stays ‘under review.’"}
{"date": "2026-01-07", "day_num": 7, "title": "Key Pressure", "events": ["In thick winter fog, Priya wakes with the new habit of feeling for the F/J bumps even under her blanket.", "Over chai, Rakesh encourages her to learn but teases her about pressing the keys too hard; Arjun makes fun and then tries the drills himself.", "Priya returns to Sharma Ji’s shop for her second 15-minute typing session and focuses on cleaner, slower home-row work.", "Sharma Ji introduces simple pattern practice (as/df and jk/kl) and scribbles a small list for Priya to practise at home.", "Priya buys potatoes and a little matar (peas) for Sunita on the way back, noticing her own ID photo sheet ghosting in the studio window.", "At night she ticks ‘Typing practice: Day 2 (15 minutes)’ and adds a new home-practice note; the BA portal remains ‘under review,’ but sits more quietly in her mind."], "facts_introduced": ["On Jan 7, Priya completes typing practice Day 2 (15 minutes) at Sharma Ji’s shop.", "Sharma Ji emphasizes ‘slow is fast’ and asks Priya to aim for cleaner home-row accuracy.", "Priya begins basic pattern drills beyond straight lines of letters (as/df and jk/kl).", "Sharma Ji scribbles a short pattern list on scrap paper for at-home practice.", "Priya adds a second checklist line: home practice for the new patterns.", "Priya buys potatoes and a small amount of matar (peas) as part of the day’s errands.", "The BA application status remains ‘under review’ on Jan 7; Priya checks once and lets it be."], "open_hooks": ["When will the BA application move from ‘under review’ to confirmed/next steps?", "Will Priya maintain her three-days-a-week typing plan—and start practising at home consistently?"], "recap": "On January 7, Priya’s new skill becomes less like an idea and more like routine: she returns for day two of typing practice, learns to go slower and cleaner, and carries a scrap of pattern drills home like another important document. The college portal still refuses to give her final confirmation, but the waiting no longer takes up the whole room."}
{"date": "2026-01-08", "day_num": 8, "title": "Name on the Screen", "events": ["On a slightly clearer winter morning, Priya rehearses the home-row pattern on her knee while the household moves quietly around Rakesh sleeping after a night shift.", "At the bus stand, Chai Uncle encourages her with a proverb-like reassurance about ‘educated fingers.’", "Sharma Ji’s cyber shop is extra crowded on Thursday with people doing form work; Priya waits with her folder on her lap.", "Irfan arrives for a practical errand; he quietly encourages Priya not to stop at day three.", "When the crowd thins, Priya completes the third 15-minute typing session; Sharma Ji makes her type her name and she sees it appear on the screen as a new kind of proof.", "A brief power flicker happens during practice; Sharma Ji tells her to continue and treat interruptions as part of the lesson.", "Sharma Ji assigns a small home routine: type ‘Priya Verma’ five times plus pattern repetitions; Priya records it as an un-ticked checkbox in her notebook.", "The BA portal remains ‘under review’ when she checks once at night, but the day ends with calmer hands and a steadier sense of forward motion."], "facts_introduced": ["Thursdays tend to be busier at Sharma Ji’s cyber/photocopy shop due to form-related crowds.", "On Jan 8, Priya completes typing practice Day 3 (15 minutes).", "Sharma Ji has Priya type her full name (‘Priya Verma’) as a simple real-word typing exercise.", "A short power flicker can occur during shop hours; practice sometimes continues through it if power holds.", "Priya begins a home typing assignment routine (name repetitions plus as/df and jk/kl patterns), tracked as checkbox tasks in her squared notebook.", "Irfan frames ‘day three’ as a common stopping point, offering quiet encouragement to continue.", "Priya buys a small biscuit packet for Arjun as a minor peace/affection gesture.", "BA application status remains ‘under review’ on Jan 8; Priya checks once and sets it aside."], "open_hooks": ["When will Priya’s BA application move from ‘under review’ to a final confirmation / next steps?", "Will Priya follow through on home practice and keep the typing habit beyond the initial three-day plan?", "Could typing lead to steadier work opportunities through Sharma Ji’s shop or other local needs?"], "recap": "On January 8, Priya reaches the third day of her small typing plan: a day when people often stop, Irfan observes, but she doesn’t. After waiting through a crowded Thursday at Sharma Ji’s shop, she types her own name on the screen and feels a new kind of seriousness settle in her hands. The college portal is still under review, yet the day ends with a tick in her notebook and a gentler confidence that she can keep going."}
{"date":"2026-01-09","day_num":9,"title":"Borrowed Warmth","events":["A cold-wave school closure quiets the lane; Arjun prepares for hybrid class at home while Rakesh sleeps after a night shift.","Priya tries to practice typing at home without a keyboard and decides to go to Sharma Ji’s shop just for ten minutes of ‘borrowed warmth.’","At the chai stall, Chai Uncle jokes that the fog is behaving like a landlord and urges her to sit on the keyboard and learn anyway.","At the cyber shop, Priya practices her name and home-row patterns; Sharma Ji then asks her to type a handwritten customer list cleanly.","Priya types the list carefully, treating names as serious; Sharma Ji prints it and pays her ₹50, calling it real work, not charity.","At home, Priya shows Sunita the ₹50; Sunita tells her to keep it safe and not wake Rakesh with the news.","Arjun, trying to stay present on a shaky connection, loudly tells his teacher ‘network issue’ while Priya laughs softly.","That night the BA portal still reads ‘Application under review,’ but it pinches less; Priya ends the day with the calming thought: work is work."],"facts_introduced":["On Jan 9 a cold-wave-related school closure affects the day’s rhythm; Arjun has hybrid/online class expectations.","Priya practices typing even outside the planned three-day rhythm, sometimes in shorter (10-minute) sessions.","Chai Uncle describes the fog as ‘behaving like a landlord,’ reinforcing winter’s clamp on movement.","Sharma Ji gives Priya a first small paid typing task: cleaning up a handwritten list (names and mobile numbers) into a neat printout.","Sharma Ji pays Priya ₹50 for the typed list and frames it as work, not charity.","Priya tucks small earnings into her notebook like a recorded fact.","Sunita advises Priya not to tell Rakesh immediately so he doesn’t worry and can sleep after his night shift.","The BA application status remains ‘under review’ on Jan 9; Priya checks once and lets it sit."],"open_hooks":["Will Sharma Ji begin calling Priya for more small typing jobs—and can it grow into steadier income?","When will Priya’s BA application move from ‘under review’ to final confirmation/next steps?","How will Arjun’s school disruptions (cold-wave closures, hybrid classes) affect the household routine and expenses?"] ,"recap":"A cold-wave closure makes Mohanlalganj feel muffled and slow, but Priya uses the quiet to keep her new habit alive. She goes to Sharma Ji’s shop just to practice, and ends up typing a real list for a customer—small, paid work that makes her learning feel sturdier. The BA portal is still under review by night, yet her hands hold a new proof: work is work."}
{"date":"2026-01-10","day_num":10,"title":"Status Bar","events":["Very dense fog hangs over Mohanlalganj; the household moves around Rakesh sleeping after a late night shift.","Sana sends a voice note urging Priya to keep typing and not obsess over the BA portal status.","At the chai stall, Chai Uncle shows a forwarded IMD warning about very dense fog and cold wave conditions.","Priya practices typing for fifteen minutes at Sharma Ji’s shop and is given a new task: typing a Hindi complaint letter for an uncle to submit at the electricity office.","Priya struggles with the Hindi keyboard layout but completes the letter cleanly; Sharma Ji pays her ₹60 and warns her to be careful with people’s words.","At home, Sunita quietly praises her (‘Shabaash’) and Priya records the earnings in her notebook.","That evening, the BA portal still reads ‘Application under review,’ but it feels more like background noise than a threat."],"facts_introduced":["On Jan 10, Priya completes another typing session (15 minutes) beyond her original three-days-a-week plan.","Priya types a Hindi complaint letter (for the electricity office) on Sharma Ji’s computer and learns that Hindi typing uses a different layout.","Sharma Ji pays Priya ₹60 for the Hindi typing job, framing it as harder work than English typing.","IMD fog/cold-wave warnings enter the household’s awareness via forwarded messages, influencing how people time their errands.","Priya is increasingly treating her phone’s status messages (‘under review’) as information, not a verdict.","Sunita gives quiet praise and continues to manage what news reaches Rakesh when he is exhausted after shifts."],"open_hooks":["Will Priya be offered more regular typing work (including Hindi) through Sharma Ji’s shop?","When will the BA application finally move from ‘under review’ to confirmed/next steps?","Will Priya’s small earnings shift household conversations about stability and studying?"],"recap":"January 10 arrives with very dense fog and a new kind of forward motion. Priya takes Sana’s blunt encouragement, borrows warmth at Sharma Ji’s shop, and turns practice into another paid task—this time a Hindi complaint letter that forces her to learn a different keyboard. The college portal stays ‘under review,’ but the status no longer fills the whole day."}
{"date": "2026-01-11", "day_num": 11, "title": "Rubber Stamp", "events": ["On a Sunday with thinner fog, the family airs quilts on the roof and keeps quiet around Rakesh sleeping after a night shift.", "Sunita begins melting jaggery to make til (sesame) laddoos ahead of Makar Sankranti.", "Priya stops at Chai Uncle’s stall, where fog/cold-wave warnings are again discussed as forwarded phone messages.", "She slips into Sharma Ji’s half-open shop for a short practice session; he adds ‘space bar’ to her drills.", "Priya asks about buying a keyboard; Sharma Ji estimates ₹300–₹400 for a USB keyboard and warns that phone typing isn’t the same.", "In the market lane she finds a second-hand keyboard quoted at ₹250 but decides not to buy yet.", "At home Priya creates a ‘KEYBOARD’ envelope and starts a small fund with ₹50, storing it behind her plastic folder.", "A portal notification arrives but is only a generic reminder to keep the acknowledgement; Priya laughs and chooses practice over refreshing the status."], "facts_introduced": ["Sunday is used for airing quilts/blankets on the roof to pull dampness out in winter.", "Sunita starts preparing til laddoos ahead of Makar Sankranti (still a few days away).", "Priya begins considering home practice equipment and asks about buying a USB keyboard.", "Sharma Ji quotes an estimated ₹300–₹400 for a basic USB keyboard and notes phone typing differs.", "In the market lane, a second-hand keyboard is offered for ₹250 but with sticky keys.", "Priya starts a dedicated ‘keyboard fund’ envelope with ₹50 and stores it near her document folder.", "Priya practices in a short session even on Sunday, adding ‘space bar’ awareness as part of typing skill.", "The college portal sends a generic notification reminding her to keep the acknowledgement for future reference; the application remains under review."], "open_hooks": ["Will Priya manage to save enough to buy a keyboard and begin more consistent home practice?", "When will the BA application move from ‘under review’ to final confirmation/next steps?", "Will small earnings and the keyboard plan shift how Priya talks to the family about work and stability?"], "recap": "January 11 is a quiet Sunday: quilts air on the roof, jaggery melts for sesame laddoos, and fog warnings circulate like routine gossip. Priya sneaks in a short typing practice, asks about buying a keyboard, and—after seeing a second-hand one she can’t yet afford—starts a small ‘KEYBOARD’ fund with ₹50. The portal’s message offers no new verdict, but she ends the day choosing steady practice over anxious refreshing."}
{"date": "2026-01-12", "day_num": 12, "title": "Utho, Jago", "events": ["Fog thins in the morning; Priya starts the day with household quiet around Rakesh sleeping after a night shift.", "Arjun gets a school chart assignment for National Youth Day (Vivekananda Jayanti); Priya helps pick and print a Vivekananda quote.", "At Sharma Ji’s shop, Priya types the quote herself on the computer in front of customers, focusing on spaces and accuracy.", "Sharma Ji asks her to type another handwritten Hindi list (names/dates); she works carefully with the Hindi keyboard layout.", "Sharma Ji pays Priya ₹70 for the Hindi typing job.", "At home, Priya adds the ₹70 to her KEYBOARD fund, taking it from ₹50 to ₹120, and helps Sunita roll til laddoos.", "The cold sharpens again by evening; Priya checks the BA portal once—still ‘under review’—and chooses practice over worrying."], "facts_introduced": ["Jan 12 is observed as National Youth Day (Vivekananda Jayanti) and becomes a school assignment prompt for Arjun.", "Priya types an English quote for Arjun’s chart at Sharma Ji’s shop, practicing typing in a public/busy setting.", "Priya completes another paid Hindi typing task (a handwritten list) and is paid ₹70.", "Priya’s KEYBOARD fund increases to ₹120 after adding the ₹70 earnings.", "UP weather pattern shifts: fog thins in the morning; colder north-westerly sharpness returns by evening (ambient).", "Priya continues to treat portal status (‘under review’) as background information rather than a verdict.", "Sunita continues Makar Sankranti preparations by making til laddoos with Priya’s help."], "open_hooks": ["When will the BA application move from under review to final confirmation/next steps?", "Will Priya save enough to buy a keyboard and begin consistent home practice?", "Will paid Hindi typing work become more regular through Sharma Ji’s shop?"], "recap": "On January 12, the fog lifts enough for the lane to look honest again, and Priya turns her new habit into something public: she types a Vivekananda quote for Arjun’s school chart and then carefully types a Hindi list for a customer at Sharma Ji’s shop, earning ₹70. At home she adds it to her keyboard fund—now ₹120—rolls sesame laddoos with Sunita, and lets the BA portal’s ‘under review’ sit quietly in the background as the evening cold returns."}
{"date": "2026-01-13", "day_num": 13, "title": "Without a Screen", "events": ["On a sharp, foggy eve of Makar Sankranti, Sunita continues sesame/jaggery preparations while the household moves gently around winter and Rakesh’s sleep cycles.", "Priya practices typing in Sharma Ji’s crowded shop and is trusted with typing a distribution list of customer names and phone numbers.", "Irfan notices Priya working and offers quiet, non-hovering support that steadies her.", "Sharma Ji pays Priya ₹50 for careful work; Priya updates her KEYBOARD fund to ₹170 and tracks the remaining ₹80.", "Priya visits the market lane’s second-hand keyboard seller, negotiates lightly, and decides to return after the festival once she has the full amount.", "A small lane-side bonfire (with Lohri as distant ambience) mirrors Priya’s ‘borrowed warmth’ theme; she checks the BA portal once—still under review—and chooses practice over refreshing."], "facts_introduced": ["Jan 13 is the eve of Makar Sankranti in Mohanlalganj; household preparations include til laddoos and a khichdi ingredient plate set aside for morning.", "Priya completes a paid English typing task: converting a handwritten customer/distribution list (names + mobile numbers) into a neat printout.", "Sharma Ji pays Priya ₹50 for the distribution list work, emphasizing care with spelling/names.", "Priya’s KEYBOARD fund increases from ₹120 to ₹170 on Jan 13; she identifies ₹80 remaining to reach ₹250.", "The second-hand keyboard in the market lane remains priced at ₹250; Priya asks the seller to hold it and plans to return after the festival.", "Irfan continues to be a quiet supportive presence, noticing Priya’s progress without making it performative.", "Winter ambience: fog persists; warmth is sought through chai stalls and occasional small bonfires in the lane."], "open_hooks": ["Will Priya manage to buy the ₹250 keyboard soon and start consistent home practice?", "Will Sharma Ji begin offering Priya more regular paid typing work?", "When will the BA application move from ‘under review’ to final confirmation/next steps?"], "recap": "On January 13, the eve of Sankranti, Priya’s new habit turns more practical: she practices in a crowded cyber shop and is trusted with typing a careful distribution list, earning ₹50 and pushing her keyboard fund to ₹170. She visits the second-hand keyboard seller again, decides to wait until after the festival to buy, and ends the day warmed by chai and a small bonfire—checking the BA portal only once, letting ‘under review’ sit quietly behind the steadier work of her hands."}
{"date":"2026-01-14","day_num":14,"title":"The Kite String","events":["On Makar Sankranti, the household keeps its volume low around Rakesh’s post-night-shift sleep while Sunita cooks khichdi and finishes til laddoos.","Kites cut through thinning fog; Arjun is intent on winning a roof-top kite battle.","Priya runs a small errand via the bus stand, where Chai Uncle offers festival laddoo and jokes about her ‘fights’ with paperwork and network.","Sharma Ji calls Priya in for a quick urgent typing job (a khichdi distribution list); Priya completes it carefully and earns exactly ₹80.","Priya’s KEYBOARD fund reaches ₹250—enough to buy the second-hand keyboard after the festival.","On the roof, Priya gets a portal update: BA application status becomes ‘Approved’ with instruction to download/print a confirmation slip; she chooses not to refresh and waits for the right moment to tell Sunita."],"facts_introduced":["Makar Sankranti in 2026 falls on Jan 14 and is marked locally with khichdi, til-gud sweets, and kite flying.","Priya receives ₹80 for an urgent typing job and reaches her target of ₹250 saved for a second-hand keyboard.","Sharma Ji sometimes calls Priya on festival days for time-sensitive typing work before closing.","Priya’s BA application status changes from ‘under review’ to ‘Approved’ on Jan 14, with a confirmation slip to download/print.","Priya is learning to treat status updates as facts without compulsive refreshing.","Kite-flying on nearby roofs is a strong Sankranti texture in the lane.","The household maintains quiet during the day to protect Rakesh’s night-shift sleep, even on festival days."],"open_hooks":["Will Priya buy the second-hand keyboard and start consistent home practice?","Will printing the BA confirmation slip lead to next steps (admit card, attendance/fees) and new pressures?","Will Sharma Ji’s ‘quick urgent jobs’ become a more regular income stream for Priya?"],"recap":"Makar Sankranti arrives with shy sun and kite cries over a lane still holding fog in its corners. Between khichdi, til-gud, and keeping the house quiet for Rakesh’s sleep, Priya sneaks in a small errand that turns into paid work: an urgent typed distribution list that finally completes her keyboard fund. Later, with the kite string humming in her hand, her phone quietly changes its verdict—her BA application is approved—two small proofs settling into the day like warmth."}
{"date":"2026-01-15","day_num":15,"title":"The Confirmation Slip","events":["The post-festival morning is quiet and foggy; Priya resolves to turn ‘Approved’ into a printed confirmation slip.","At Sharma Ji’s shop, she logs into the portal, downloads and prints two copies of her BA confirmation slip, and files them in her plastic folder.","Ambient news mentions Army Day (Jan 15) and widespread fog; forwarded IMD-style warnings circulate at the bus stand.","Priya uses her ₹250 KEYBOARD fund to buy the second-hand keyboard from the market lane seller and brings it home wrapped in newspaper.","At home she cleans the keyboard, tests the F/J bumps, and practices typing her name without a screen, feeling a new kind of steadiness."],"facts_introduced":["On Jan 15, Priya downloads and prints her BA confirmation slip after the status changes to ‘Approved’","Priya prints (and keeps) two copies of the confirmation slip, treating duplicates as practical protection.","Priya buys a second-hand USB keyboard for ₹250 and brings it home wrapped in newspaper.","The keyboard’s tactile F/J home-row bumps matter to Priya as anchor points for practice.","Priya begins at-home typing practice by using the keyboard even without a screen, focusing on muscle memory and sound.","Army Day (Jan 15) appears as ambient radio/news texture during errands.","Very dense fog/cold-wave warnings circulate socially via forwarded messages, shaping how errands are timed."],"open_hooks":["Will Priya connect the keyboard to a device soon (phone/OTG or a borrowed laptop) to practice with real feedback?","Will printing the confirmation slip trigger new next steps (admit card, attendance/fees) and fresh pressures?","Will Sharma Ji’s paid typing work become more regular now that Priya can practice at home?"],"recap":"On January 15, the day after Sankranti, Priya turns a quiet phone notification into paper: she goes to Sharma Ji’s shop, downloads her BA confirmation slip, and prints two copies to file safely. With her keyboard fund complete, she buys a second-hand keyboard and brings it home like a careful new utensil, wiping the keys and practicing her name by sound and touch. The fog and forwarded warnings continue outside, but inside the day leaves her with two small proofs—one printed, one in her hands."}
{"date": "2026-01-16", "day_num": 16, "title": "The Small Connector", "events": ["An orange-level fog warning and thick winter cold shape the morning’s rhythm in Mohanlalganj.", "Priya brings her new second-hand USB keyboard to Sharma Ji and buys an OTG adapter for ₹60 to connect it to her phone.", "The keyboard successfully connects; Priya sees her typed letters appear on her own screen for the first time.", "At home she starts a strict 15-minute practice session with visual feedback using a typing practice site.", "When Sana sends a voice note, Priya replies by typing a short message and sends it without over-editing."], "facts_introduced": ["IMD-style ‘orange’ alert for very dense fog is discussed as ambience; fog affects travel and shift timing.", "Priya buys an OTG (on-the-go) adapter from Sharma Ji for ₹60.", "Priya’s phone supports a physical keyboard connection; a ‘Physical keyboard connected’ message appears.", "Priya begins practicing typing with real-time on-screen feedback using her phone + keyboard.", "Priya follows a 15-minute practice timer and stops even when she wants to continue.", "Priya starts sending typed WhatsApp messages (not only voice notes) to Sana.", "Sunita accepts the small spend after a pause, ‘adjusting an internal budget.’"], "open_hooks": ["Will Priya keep the daily 15-minute at-home typing habit now that she has feedback?", "Will typed messaging change her confidence and how she participates in school/college-related coordination with Sana?", "Will more paid typing work appear now that Priya can practice consistently at home?"], "recap": "January 16 arrives wrapped in cold and an orange-level fog warning, but Priya’s attention is on a smaller weather of her own: the click of keys. With a ₹60 OTG adapter from Sharma Ji, her second-hand keyboard finally speaks to her phone, and her practice begins to answer back in visible letters. By afternoon she keeps a strict fifteen-minute routine and sends Sana a typed reply without shrinking it through edits—small proof that her hands are learning to be direct."}
{"date":"2026-01-17","day_num":17,"title":"The Thumbs-Up","events":["Rakesh returns from a night shift before dawn; the household moves in winter hush under dense fog.","Priya keeps her 15-minute at-home typing practice routine with phone + keyboard, then runs a small vegetable errand.","A warehouse WhatsApp group message about fog delays wakes Rakesh; he struggles to type a reply on the phone.","Priya connects her keyboard to Rakesh’s phone and types a clear message to his supervisor; the thumbs-up reply steadies the morning.","Sana visits in the afternoon with notes; they study together, and Arjun proudly turns Priya’s typing into ‘news.’"],"facts_introduced":["Priya uses her keyboard for a real household task: typing a workplace message for Rakesh.","Rakesh is in a warehouse WhatsApp group where fog delays/shift timing are coordinated.","Priya can connect her keyboard (via OTG) to another phone, not just her own.","Sunita respects Priya’s 15-minute timer once she sees it as serious practice.","Sana and Priya set an in-person study time (4 pm) to work through BA material.","Sana corrects Priya’s English gently during study, keeping it practical.","Arjun sends a voice note bragging that Priya types ‘like an office,’ spreading her progress socially.","Dense fog continues to disrupt transport timing; people discuss train/bus delays as everyday winter talk."],"open_hooks":["Will Priya’s typing skill start getting pulled into more ‘serious’ family tasks (forms, letters, work messages), changing expectations?","Will Sana’s study visits become a steady routine now that Priya’s BA approval is real?","Will Priya’s growing usefulness at home lead to more paid typing work—or less time for herself?"],"recap":"On a foggy Saturday, Priya keeps her new fifteen-minute practice promise and then finds a real test for it: her father’s warehouse group pings about delays, and his tired thumbs can’t shape a clean reply. Priya plugs in her keyboard, types the message, and watches it return as a simple thumbs-up—small relief settling into the courtyard like weak winter sun. By afternoon Sana arrives with notes, and Priya’s quiet progress has already become gossip through Arjun’s proud voice note."}
{"date":"2026-01-18","day_num":18,"title":"The List in Blue","events":["On a quieter Sunday with thinner fog, Priya keeps her strict 15-minute typing routine on her phone with the new keyboard.","She starts typing grocery lists into her phone (WhatsApp-to-self/notes), discovering that typed words can hold a day steady.","While shopping in the market lane, she spots a torn hand-written ad: ‘Computer operator required — typing + basic form filling’ and photographs it.","At Sharma Ji’s shop, Sharma Ji identifies the ad as a recurring need at a small clinic near canal road and offers to run a one-page typing + form-filling ‘practice test’ tomorrow.","Priya completes a paid Hindi typing job (a ration shop list) for ₹70 and comes home with a new, practical next step."],"facts_introduced":["Priya begins using typed phone notes (a grocery list) as part of her daily system, not just paper checklists.","Priya sees and photographs a torn job advertisement for a computer operator role requiring typing and basic form filling.","Sharma Ji believes the ad is for a small clinic near canal road that repeatedly hires for form-filling/printing tasks.","Sharma Ji offers Priya a one-page typing and basic form-filling practice/test on Jan 19 to prepare for the role.","Priya types a Hindi ration shop list at Sharma Ji’s shop and earns ₹70.","Sunday market crowds can exhaust coriander early; Priya comes home without fresh coriander.","Rakesh’s warehouse shift pattern remains flexible; he expects an evening call if needed on Sunday."],"open_hooks":["Will Priya pass Sharma Ji’s one-page typing/form practice and pursue the clinic operator opportunity?","Will this new potential job change the household’s expectations of Priya’s time and ‘usefulness’?"] ,"recap":"On January 18, Sunday’s quiet doesn’t mean Priya is idle: she keeps her timer, types a line the phone dutifully names for her, and discovers that a typed grocery list can pin a day in place. In the market lane she photographs a torn ‘computer operator required’ notice, and by afternoon Sharma Ji turns it into a tomorrow: one page of typing, one small form, practice like proof. She ends the day with ₹70 folded into her notebook and a new kind of steadiness—blue letters on a screen holding ordinary things cleanly."}
{"date":"2026-01-19","day_num":19,"title":"One Page","events":["On a cold Monday morning, Priya keeps her strict 15-minute at-home typing routine before heading out.","At Sharma Ji’s shop, he gives her a one-page English typing test and makes her correct small errors instead of ignoring them.","He then gives her a sample clinic-style patient registration form and stresses that she must never guess unclear details—especially numbers.","Priya admits when a phone number is unclear; Sharma Ji rewrites it and frames the sentence ‘Number not clear’ as the right kind of bravery.","Sharma Ji advises her to visit the canal-road clinic, ask directly if the vacancy is real, and treat rejection as a cue to practice, not a verdict.","Back home, Priya turns the day into a small typed checklist—questions and what to carry—ending with the settling comfort of a blank next page."],"facts_introduced":["On Jan 19, Sharma Ji runs Priya through a one-page English typing practice/test as preparation for a clinic operator job.","Priya’s common errors include missing small words and swapping similar words (e.g., ‘from’/‘form’); she learns to fix them systematically.","Priya practices using arrow keys and on-screen correction as part of real-world typing, not just drills.","Priya fills a sample patient registration form and learns that forms require specific, non-guessed truth.","Sharma Ji explicitly teaches a rule: never guess unclear details; ask the person to repeat.","Priya learns a usable sentence for clerical work: ‘Number not clear. Please tell again.’","Sunita judges written output by neatness and seriousness (‘Paper should look like it knows what it is saying’).","Priya begins writing typed ‘what to carry / what to ask’ lists as a bridge from practice to real-world approach.","Winter fog continues as background texture; mornings are harsh, afternoons soften enough that people forget the morning.","Arjun frames Priya’s practice as an ‘exam,’ turning it into household comedy while raising the stakes gently."],"open_hooks":["Will Priya approach the canal-road clinic—and will they offer a real trial shift or test?","If she starts working there, will the steadier income also tighten expectations on her time at home?"],"recap":"On January 19, Priya turns tomorrow’s possibility into something tangible: one full page typed, then a form filled box by box. Sharma Ji’s harshness becomes a kind of instruction—fix the small errors, never guess what you can’t read, and learn to ask for clarity without shame. By afternoon, the fog thins and the day settles into a simple comfort: a checklist typed in blue, and another blank page waiting."}
{"date":"2026-01-20","day_num":20,"title":"Six Digits","events":["Priya keeps her strict fifteen-minute typing routine at home, focusing on numbers and stopping on time.","She travels toward a small clinic near canal road (Lucknow side) to ask about the ‘computer operator’ notice.","At the desk, she introduces herself and references Sharma Ji’s cyber shop as her training.","The clinic desk woman tests her immediately by having her fill a real patient registration form as a patient arrives.","Priya asks for unclear phone digits to be repeated and requests the pin code instead of guessing.","Impressed, the desk woman offers Priya a half-day trial tomorrow at 10 and asks her to bring Aadhaar photocopies (and PAN if she has it).","Back home, Priya turns the instruction into a typed checklist and practices writing six digits cleanly."],"facts_introduced":["Priya practices number strings intentionally (dates, phone-like digits) as part of typing skill-building.","A small clinic near canal road on the Lucknow side may hire a ‘computer operator’ for registrations/printing.","Priya’s ‘never guess’ rule becomes actionable: she asks, ‘Number not clear—please tell again.’","Pin codes become a new precision point in forms; Priya notes Mohanlalganj pin code 226301.","The clinic runs on registers + a basic computer + a small printer; fingerprints and paper are constant.","Priya is offered a trial half-day shift at the clinic (next day, 10am), pending documents.","Document requirements for trial work include Aadhaar photocopies (and PAN if available)."],"open_hooks":["How will Priya handle her first trial half-day at the clinic—speed, accuracy, and social confidence?","If she gets the role, will steadier income also tighten expectations on her time at home?","Will Priya’s growing comfort with ‘small boxes’ (digits, pin codes, forms) change how she imagines her future?"],"recap":"On January 20, Priya carries yesterday’s lessons into a new kind of test. After a disciplined fifteen minutes of number practice, she goes to the canal-road clinic and is made to fill a real registration form for a real patient—no sample, no rehearsal. When digits blur, she does the brave, ordinary thing: she asks for clarity instead of guessing. By the time she returns home, tomorrow has a time and a requirement list, and six steady digits sit under her fingers like an address."}
{"date": "2026-01-21", "day_num": 21, "title": "The Paper Tray", "events": ["Morning fog persists; Priya gathers Aadhaar photocopies, pen, and a packed roti before leaving for the clinic trial.", "At the bus stand, Chai Uncle wishes her well; people repeat visibility numbers and joke through the cold.", "At the canal-road clinic, the desk woman puts Priya straight onto registration and computer entry work.", "Priya continues her ‘never guess’ rule, asking for phone digits and pin codes to be repeated when unclear.", "The printer jams; Priya learns to clear the paper tray slowly and gets it printing again.", "At the end of the half-day trial, the desk woman asks Priya to return tomorrow at 10 with an extra Aadhaar copy and passport photos, and gives her ₹200 as travel/trial money.", "Back home, Sunita files the notes away; Priya types a fresh checklist and practices fifteen minutes to settle her hands."], "facts_introduced": ["Dense winter fog continues to shape travel timing; people discuss visibility in ‘metres’ at the bus stand.", "The clinic’s registration work includes both a paper register and computer entries, plus printing small slips.", "Priya learns a basic printer rule: clear a paper jam by pulling the sheet slowly, then reseat the tray.", "Priya repeats numbers back (mobile and pin code) as an accuracy habit, not just a politeness.", "Priya does her first half-day trial shift at the clinic on Jan 21 and is asked to return the next day.", "The clinic requests additional documents for continuing: an extra Aadhaar copy and passport-size photos.", "Priya receives ₹200 from the clinic as travel/trial money after the half-day.", "Sunita keeps small earned cash in a tin as part of the household’s ‘small truths’ accounting."], "open_hooks": ["Will Priya be taken on more formally at the clinic after the trial days—and at what pay/terms?", "Can Priya maintain accuracy under a growing queue, or will speed pressure tempt her into guessing?", "If the clinic work becomes steady, how will it reshape Priya’s time for BA and home responsibilities?"], "recap": "On January 21, fog makes the morning small, but Priya goes anyway—Aadhaar copies in her bag, a roti wrapped in newspaper, and one rule in her mouth: don’t guess. At the clinic she learns that real work is made of registers, printers, and impatient faces, and she survives it by asking for clarity and fixing a paper jam without drama. By afternoon she returns home with ₹200 as trial money and a new instruction—come again tomorrow—then ends the day with a typed checklist and fifteen steady minutes of practice."}
{"date": "2026-01-22", "day_num": 22, "title": "The Stapled Face", "events": ["Priya returns to the canal-road clinic for her second half-day trial, carrying passport photos and an extra Aadhaar copy through thinner morning fog.", "The desk woman has Priya fill a one-page staff-details form; she staples Priya’s photo to it and asks about a PAN card, telling her to make it later.", "Priya handles registrations faster today—register first, computer second—keeping her ‘number not clear’ rule when phone digits are rushed.", "Priya writes a medicine restock list as the desk woman dictates, asking for spellings instead of guessing.", "The desk woman tells Priya to come again tomorrow at 10 and pays her ₹200 as travel/trial money, same as yesterday.", "Priya stops at Sharma Ji’s shop to ask about PAN; he matter-of-factly lists the documents needed and says they can do it soon.", "At home, Sunita rolls leftover til laddoo for Saraswati/Vasant Panchami tomorrow, and Arjun announces Republic Day practice and the ‘Vande Mataram’ song at school."], "facts_introduced": ["Priya submits passport photos and an additional Aadhaar copy to the clinic, and the desk begins a simple file/record for her trial work.", "The clinic expects a PAN card eventually for formal work, but it is not required immediately.", "The desk woman staples Priya’s passport photo to a staff-details sheet—an ‘official’ feeling proof.", "Priya can take dictation for lists (medicine names) and checks spellings instead of guessing.", "Vasant Panchami falls on Jan 23 in 2026; yellow marigolds and ‘kal basant panchami’ talk begin to appear in the streets.", "Priya receives ₹200 again as trial/travel money on Jan 22.", "Sharma Ji can help apply for PAN given Aadhaar, photos, and mobile details.", "Arjun’s school begins Republic Day practice, including singing ‘Vande Mataram.’", "Fog warnings remain part of daily public chatter even when daytime visibility improves.", "Priya uses typed phone lists not only for tasks but also as a way to steady herself before and after work."], "open_hooks": ["Will the clinic offer Priya a regular position and clear pay/terms after the next trial day?", "Will Priya manage the PAN application without it becoming another slow, stressful document loop?", "How will Vasant Panchami and Republic Day obligations tug at Priya’s new clinic routine?"], "recap": "On January 22, Priya returns for the second day of her clinic trial with photos and an extra Aadhaar copy tucked safely in her folder. A stapler click turns her face into paperwork, and the desk woman’s practical question—PAN?—adds a new future task without breaking the day. Priya works through registrations by leaning on her rule of not guessing, earns another ₹200, and ends the evening the way she has begun to end many days: with a typed list, a timer, and the small comfort of keys that answer back."}
{"date": "2026-01-23", "day_num": 23, "title": "Yellow Keys", "events": ["On Vasant Panchami, Sunita spreads a yellow dupatta and marigolds in the courtyard while Priya dresses for her clinic shift.", "At the bus stand, Chai Uncle ties a yellow ribbon to his stall and tells Priya that forms are also exams—because they demand truth.", "At the canal-road clinic, Priya works the register and computer in a steady rhythm, repeating digits back and refusing to guess when numbers blur.", "The desk woman offers Priya a yellow sweet and tells her to start coming daily from Monday (10am–2pm); pay will be decided, and Priya must apply for PAN and bring the receipt next week.", "Priya is handed ₹300—less like travel money, more like wages—and takes the news home to a small Saraswati puja where Sunita touches marigolds to Arjun’s books and Priya’s keyboard.", "In the evening, Priya lets her hands rest, writes one line in pen—‘Monday: ten to two. Don’t guess.’—and watches the yellow of the day linger in small places."], "facts_introduced": ["Jan 23 is Vasant Panchami (Basant Panchami), marked by yellow cloth, marigolds, and Saraswati puja for learning.", "Chai Uncle decorates his tea stall with a thin yellow ribbon for the festival.", "The clinic asks Priya to begin a daily schedule from Monday: 10am to 2pm.", "The clinic’s terms are still forming: pay will be decided, but Priya receives ₹300 on Jan 23 (her first amount that feels like wages rather than trial/travel money).", "The clinic expects Priya to apply for a PAN card soon and bring the application receipt next week.", "Sunita includes Priya’s USB keyboard in the Saraswati puja alongside Arjun’s school books, treating it as a learning tool.", "Priya sometimes chooses rest over practice; she skips her 15-minute typing timer on Jan 23 to let the day settle."], "open_hooks": ["Will the clinic formalize Priya’s pay and terms as she begins daily work?", "Will Priya manage the PAN application smoothly and bring the receipt on time?", "How will daily clinic hours reshape Priya’s time for BA work and home responsibilities?"], "recap": "Vasant Panchami paints the day yellow—from the courtyard dupatta to a ribbon at Chai Uncle’s stall. Priya works another half-day at the clinic and hears a new, heavier instruction: come daily from Monday, and get a PAN made. With ₹300 in her hand and marigolds pressed to her keyboard at home, she ends the evening not with more practice, but with one careful line in her notebook and the comfort of a schedule that finally has edges."}
{"date": "2026-01-24", "day_num": 24, "title": "The Receipt Number", "events": ["A thin morning mist (not the earlier dense fog) hangs in the lane; Priya wakes with Monday’s new clinic schedule in her mind.", "On the bus-stand radio, ‘National Girl Child Day’ is mentioned; Chai Uncle teases Priya about ‘big people’ paperwork.", "Priya goes to Sharma Ji’s cyber shop to apply for a PAN card as requested by the clinic.", "The application requires an email; with Sharma Ji’s help, Priya creates her first email account and carefully handles OTP digits without guessing.", "The PAN application payment succeeds; Sharma Ji prints the acknowledgement receipt and tells Priya to keep it flat and safe.", "At home, Priya uses her phone+keyboard setup to type ‘Vande Mataram’ lyrics for Arjun’s Republic Day practice and ends the day with the comfort of proof: a number in her folder and a time on Monday."], "facts_introduced": ["Jan 24 is observed/mentioned as National Girl Child Day (ambient radio/program talk).", "By late January, Lucknow-side mornings can have shallow mist while the day turns mainly clear (ambient).", "Priya begins the PAN-card process because the clinic requests a PAN application receipt next week.", "Priya creates her first email account (with Sharma Ji’s help) to complete official online applications.", "OTP-based verification is a routine friction point; Priya applies her ‘don’t guess’ rule to digits.", "Priya completes PAN application payment via UPI without a failure this time.", "Sharma Ji prints a PAN acknowledgement receipt and emphasizes keeping it flat and safe in Priya’s folder.", "Priya uses her keyboard+phone setup for practical household/school help: typing lyrics for Arjun’s Republic Day practice."], "open_hooks": ["Will the PAN application process complete smoothly (and will Priya be able to manage the new email/password without it becoming another document loop)?", "Will the clinic accept the receipt and formalize Priya’s pay/terms once she starts daily work on Monday?", "How will daily clinic hours and Republic Day week obligations reshape Priya’s time for BA work and home responsibilities?"], "recap": "January 24 is a Saturday of softer weather and sharper paperwork. With mist in the morning and a clear afternoon, Priya turns the clinic’s instruction—make a PAN—into a printed acknowledgement slip, creating an email, waiting for OTP digits, and finally sliding the receipt into her plastic folder like a new kind of protection. Back home, she uses her keyboard to help Arjun with Republic Day practice and ends the day steadied by small proofs: a number on paper and a time on Monday."}
{"date": "2026-01-25", "day_num": 25, "title": "Two Alarms", "events": ["On a clear winter Sunday as the fog thins, Priya wakes early with Monday’s clinic schedule already sitting in her mind.", "She lays out her documents and essentials like ingredients: plastic folder kept flat, Aadhaar copies, cash for the bus, and—at Sunita’s insistence—two pens.", "Republic Day being tomorrow makes Priya wonder if the clinic will be open, but she decides to go anyway unless told otherwise.", "Priya receives her first ‘welcome’ email and messages Sana for reassurance; Sana warns her not to click random links and to keep the password safe.", "Arjun leaves for Republic Day practice, singing too loudly; the lane fills with small flags and a crackling loudspeaker.", "Priya keeps a strict 15-minute typing session focused on numbers and her ‘don’t guess’ sentence, then sets two alarms (7:30 and 7:45) for the morning."], "facts_introduced": ["By late January, some days in Mohanlalganj are clear with little to no fog; winter sun feels ‘honest’ rather than harsh.", "Priya begins a pre-work packing habit: documents flat in the plastic folder, cash for the bus, water, and two pens.", "Sunita insists on redundancy for practical work (two pens, not one).", "Priya receives her first welcome email on Jan 25 and begins using email as a real, lived tool (notifications, subject lines).", "Sana advises Priya on basic digital safety: avoid random links; keep passwords safe.", "Priya plans to report to the clinic even on Republic Day (Jan 26) unless explicitly told it is closed.", "Priya sets two phone alarms (7:30 and 7:45) before her first regular clinic day as a practical trust system."], "open_hooks": ["Will the clinic actually be open on Republic Day, and how will Priya handle her first ‘daily’ start if the schedule collides with a holiday?", "Will the clinic formalize Priya’s pay and terms as she begins coming regularly?", "Will Priya manage her new email/password smoothly without it becoming another document loop?"], "recap": "On Jan 25, Sunday feels clear and strangely exposed without the month’s usual fog. Priya turns tomorrow into a small pile of practical things—flat papers, two pens, a short typing timer, and two alarms—while Republic Day rehearsal noise drifts through the lane. A ‘welcome’ email and Sana’s quick advice make her new digital life feel real, and by night she settles into bed with a quiet decision: holiday or not, she will show up."}
{"date": "2026-01-26", "day_num": 26, "title": "The Open Shutter", "events": ["On Republic Day morning, Priya wakes to her two alarms and commits to reporting to the clinic despite the holiday.", "She watches Arjun’s school flag-hoisting ceremony briefly and sees him sing with loud conviction before she heads out.", "At the canal-road clinic, Priya arrives to find the shutter down and a holiday note taped up; she waits outside rather than turning back.", "The clinic desk woman arrives, tears down the holiday note, and opens up anyway, saying illness doesn’t take a holiday.", "Priya works registrations and typing tasks (including a simple certificate), repeating digits back and asking for clarity instead of guessing.", "Priya receives ₹300 and is told to come again tomorrow; she returns home steadied by the simple fact that she showed up."], "facts_introduced": ["Republic Day is marked locally with school flag hoisting, small flags on doors and stalls, and laddoo distribution to children.", "Priya’s ‘two alarms’ system becomes a practical part of her new workday routine.", "The canal-road clinic opens even on Republic Day, despite a holiday notice initially being taped to the shutter.", "Priya chooses to wait outside the closed shutter instead of leaving, signalling reliability in the new job routine.", "The desk woman frames the clinic’s ethos simply: illness (fever) does not take a holiday.", "Priya adds a new task type at the clinic: typing a short certificate/letter dictated by the desk woman.", "Priya receives ₹300 again for the day, reinforcing that the clinic work is turning into real wages even before terms are fully formalized."], "open_hooks": ["When and how will the clinic formalize Priya’s pay and terms as she begins daily work?", "Will Priya manage the PAN receipt requirement next week without another slow document loop?", "How will daily clinic hours reshape Priya’s time for BA work and household responsibilities?"], "recap": "On January 26, Republic Day fills the lane with flags, school songs, and sugar-sweet laddoos, but Priya’s attention stays on her new promise: show up. When she finds the clinic shutter down under a holiday note, she waits anyway—long enough for the desk woman to arrive, tear it down, and open the clinic with the blunt reminder that fever doesn’t take holidays. A shorter shift, a typed certificate, and ₹300 in her hand send Priya home with a quiet kind of pride: she didn’t guess, and she didn’t run."}
{"date": "2026-01-27", "day_num": 27, "title": "The Second Pen", "events": ["Priya shows up on time for a normal (non-holiday) clinic day and finds it busier than yesterday.", "She holds her ‘don’t guess’ rule under speed pressure, asking patients to repeat unclear phone digits and repeating them back.", "A small moment with a toddler makes Priya grateful for Sunita’s insistence on carrying two pens.", "Priya tops up the printer paper and clears a minor paper jam calmly, treating it as routine rather than a crisis.", "Sana checks in by message; Priya replies with a small, proud update about not guessing and handling the printer.", "The desk woman states that, for now, Priya will be paid ₹300 per day for the 10am–2pm shift and reminds her to bring the PAN acknowledgement receipt next week.", "Back home, Priya keeps her 15-minute practice timer and records the day in a short typed note."], "facts_introduced": ["On Jan 27, the clinic sets Priya’s pay (for now) at ₹300 per day for the 10am–2pm shift.", "Priya begins to treat phone-checking during work as something to do only during lulls, giving worktime edges.", "Carrying two pens becomes a practical reliability habit; the ‘second pen’ matters in small, real ways.", "Priya loads printer paper by tapping the stack edges to align it, turning it into a small ritual for smooth printing.", "Non-holiday clinic days can be noticeably busier, with a sense of backlog after closures.", "Priya starts mentally separating money into categories (home needs vs other goals), building an internal ‘shelves’ system.", "Morning fog is thin and lifts by midday, shifting the feel of travel and crowding."], "open_hooks": ["Will the clinic formalize Priya’s terms beyond day-by-day cash pay (and will the amount change)?", "Will Priya bring the PAN receipt on time—and will the PAN process complete smoothly?", "Can Priya sustain daily clinic hours while keeping BA momentum and at-home practice?"], "recap": "On an ordinary Tuesday after the holiday, Priya discovers the real shape of her new routine: a busier queue, faster numbers, and small tests of steadiness. She holds to her rule of not guessing, learns to treat printer trouble as a simple problem, and finds that even a second pen can be the difference between fluster and calm. By afternoon, the desk woman puts a repeating number to the work—₹300 per day, for now—and Priya goes home with a quieter kind of pride: habit, held."}
{"date": "2026-01-28", "day_num": 28, "title": "The Subject Line", "events": ["Morning begins with Priya’s two alarms and a thin patch of fog; she does a strict 15‑minute number-focused typing practice on her phone + keyboard.", "At the bus stand, Chai Uncle shows an IMD-style forecast: shallow to moderate morning fog, clear sky later, and temperatures around 23°C/11°C.", "At the canal-road clinic, Priya continues registration work under speed pressure, asking patients to repeat unclear digits instead of guessing.", "The desk woman checks Priya’s PAN acknowledgement receipt and asks her to bring a photocopy next week to start a staff file.", "During a lull, Priya notices an official-looking PAN email in her new inbox and chooses not to open links until she can verify.", "After her 10am–2pm shift and ₹300 pay, Priya goes to Sharma Ji for a photocopy and confirmation that the email is routine, then records the day in a short typed note."], "facts_introduced": ["IMD Lucknow press-note style forecast for Jan 28: shallow to moderate morning fog, mainly clear sky in daytime; max/min around 23°C/11°C; dense fog possible at isolated places.", "Priya keeps a strict 15-minute at-home typing routine even after starting daily clinic work, with extra focus on number strings.", "The clinic begins assembling a staff file for Priya and will keep a photocopy of her PAN acknowledgement receipt.", "Priya receives official-looking emails now and uses Sana’s advice as a rule: don’t click unknown links; verify first.", "Priya learns to pay attention to an email’s subject line as a quick safety/meaning cue.", "Priya continues to treat reliability as a skill: documents flat, two pens, and showing up daily.", "Sharma Ji remains Priya’s practical digital gatekeeper: photocopies, verification, and simple rules.", "The clinic work continues at ₹300 per day for the 10am–2pm shift."], "open_hooks": ["Will Priya’s PAN application complete smoothly (and will she manage her new email account without confusion)?", "Will the clinic formalize Priya’s terms beyond day-by-day cash pay as her file begins to take shape?", "Can Priya keep BA momentum alongside daily clinic hours and her self-imposed typing routine?"], "recap": "On January 28, a thin morning fog gives way to a clear winter day, and Priya’s routine grows sharper: two alarms, fifteen minutes of number practice, then the clinic’s steady queue of names and digits. When an official-looking PAN email arrives, she chooses the quiet courage of a pause—no clicking until she can verify. By evening she has a photocopy ready for the clinic’s new file and a short typed note that feels like proof: she didn’t guess, and she didn’t rush."}
{"date": "2026-01-29", "day_num": 29, "title": "The Paperclip", "events": ["Priya wakes to her two alarms under shallow morning fog, keeps a strict 15-minute keyboard practice focused on dates and pin-code numbers.", "At the bus stand, Chai Uncle repeats an IMD-style forecast for Lucknow: shallow to moderate morning fog, clear sky later, and roughly 21°C/10°C.", "At the clinic, Priya maintains her ‘don’t guess’ rule with rushed phone numbers, asking patients to repeat digits.", "The desk woman starts a simple staff file for Priya (a cardboard file cover) and tells her to bring PAN and photo copies next week / one more photo if possible.", "Priya receives another PAN-related email and notices a paperclip icon, but waits to open it.", "After her shift and ₹300 pay, she visits Sharma Ji, learns that the paperclip indicates an email attachment (‘paper that travels’), and has him open/print the PDF safely."], "facts_introduced": ["IMD Lucknow press note (Jan 29) indicates shallow to moderate morning fog with mainly clear sky later; forecast max/min around 21°C/10°C; broader UP warning mentions dense/very dense fog in parts of the state.", "Priya practices dates and number strings (pin codes) deliberately as part of her daily 15-minute typing routine.", "The clinic begins an actual staff file for Priya (cardboard cover with neatly written details) as part of making her presence official.", "The clinic requests additional documentation support: PAN-related copy for the file and possibly an extra passport photo.", "Priya learns the email ‘paperclip’ icon signifies an attachment; Sharma Ji describes it as ‘paper that travels.’", "Priya keeps her safety habit: she avoids opening unknown email items on her phone and verifies with Sharma Ji.", "Priya continues to receive ₹300 per day for the 10am–2pm clinic shift."], "open_hooks": ["Will Priya manage the extra photo / file requirements without new costs turning into stress?", "Will the PAN process complete soon (e-PAN / physical card), and will the clinic ask for the final number?", "Can Priya keep BA studying alive alongside daily clinic work and her strict practice habit?"], "recap": "On January 29, the morning fog returns but behaves, and Priya’s day holds its edges: two alarms, fifteen minutes of number practice, and a steady queue at the clinic where she refuses to guess digits. The desk woman begins a staff file for her—cardboard and neat handwriting turning her into something official. When a new PAN email arrives with a paperclip icon, Priya chooses caution over curiosity, and by evening she learns what it means: an attachment, paper that travels, made safe once it is printed and filed."}
{"date": "2026-01-30", "day_num": 30, "title": "Two Minutes", "events": ["Priya wakes to fog, two alarms, and Rakesh sleeping after a night shift; she keeps her 15-minute keyboard practice focused on dates and pin-code numbers.", "At the bus stand, Chai Uncle repeats a forecast-style message: fog in the morning, clearer later, and a cold day feel.", "At the clinic, Priya continues registration work, insisting patients repeat unclear digits instead of guessing.", "At 11:00, a two-minute silence is observed, briefly turning the busy clinic quiet.", "The desk woman reminds Priya to bring an extra passport photo for her staff file; Priya promises she will.", "After her shift and ₹300 pay, Priya gets fresh passport photos made near the market lane, stores them carefully in her plastic folder, and Sharma Ji advises her to keep an extra copy for herself.", "Priya ends the day with her strict 15-minute practice and a short typed note about the silence and the photo."], "facts_introduced": ["Jan 30 (Martyrs’ Day in India) includes a two-minute silence at 11:00am, observed even in everyday spaces like a clinic.", "Priya starts practising dates and slashes (30/01/2026) as part of her number-accuracy training.", "The clinic expects Priya’s staff file to include an additional passport photo; the file is becoming more formal and complete.", "Priya gets a fresh set of passport photos from a small market-lane studio and stores them between sheets so corners don’t bend.", "Sharma Ji’s practical rule: never hand over every copy; always keep one for yourself.", "Rakesh has another warehouse night shift cycle, and the household keeps quiet around his sleep.", "Priya continues at ₹300 per day for the 10am–2pm clinic shift."], "open_hooks": ["Will Priya successfully submit the extra photo to the clinic file without new paperwork friction?", "Will Sunday become Priya’s protected time for BA tasks now that clinic work is daily?", "When will the PAN process complete fully (final number/card), and what will the clinic ask for next?"], "recap": "On January 30, fog lifts slowly and the day holds its edges: two alarms, fifteen minutes of number practice, and the clinic’s steady rush of names and digits. At eleven, the room pauses for two minutes of silence, and Priya feels how quiet can change a place. By afternoon she has ₹300 folded away and fresh passport photos tucked safely in her folder—small proofs that she is becoming official, not loudly, but neatly, like paper put into the right drawer."}
{"date": "2026-01-31", "day_num": 31, "title": "The Label Sheet", "events": ["Priya wakes to a sharp winter cold (no thick fog) and keeps her strict 15-minute keyboard practice before packing her folder with an extra passport photo.", "At the bus stand, people talk about a possible Bharat bandh on Feb 1 over UGC Regulations 2026; Priya quietly worries about protecting Sunday for her own BA tasks.", "At the canal-road clinic, month-end organization begins: the desk woman staples Priya’s extra photo into her staff sheet and has Priya write neat sticker labels for January and a staff-files drawer.", "Under queue pressure, Priya keeps her ‘don’t guess’ rule, asking patients to repeat digits slowly and repeating them back.", "After her 10am–2pm shift and ₹300 pay, Priya buys a label sheet and a black marker, then goes to Sharma Ji to print BA syllabus pages early in case Sunday becomes difficult.", "At home, Priya files the new papers and writes a small note, promising herself one protected hour of reading on Sunday—bandh or not."], "facts_introduced": ["Jan 31 brings month-end organizing at the clinic, including sticker labels for registers/drawers.", "Priya submits an extra passport photo; the clinic’s staff file for her becomes more complete.", "The desk woman trusts Priya with labeling tasks and notes her neat handwriting.", "Priya buys a sheet of sticker labels and a black marker from the market-lane stationery shop for work organization.", "Bus-stand news chatter mentions a Bharat bandh call for Feb 1 linked to protests over UGC Regulations 2026.", "To reduce friction, Priya prints BA syllabus pages at Sharma Ji’s shop ahead of Sunday.", "Priya frames Sunday as protected ‘one hour’ for her own studying, mirroring her 15-minute typing discipline.", "Weather texture: a cold night/morning with a milder afternoon (roughly ~9°C low / ~18°C high).", "Priya continues to receive ₹300 per day for the 10am–2pm clinic shift."], "open_hooks": ["Will the Feb 1 bandh (or its talk) disrupt Priya’s plan to protect Sunday for BA work?", "Will Priya’s clinic responsibilities expand from registration into more administrative organization as her file and routines solidify?", "Can Priya keep her new ‘one hour for myself’ boundary as daily work and household needs continue?"], "recap": "On January 31, cold replaces fog and Priya’s routine holds: alarms, fifteen minutes of practice, then the clinic’s steady queue. Month-end brings a new kind of trust—an extra photo stapled into her staff sheet and a small stack of labels that make drawers and months feel controllable. With bandh talk floating through the bus stand, Priya quietly adjusts: she prints her BA syllabus early and promises herself one protected hour on Sunday, the way she promises her fingers a timer and keeps it."}
{"date":"2026-02-01","day_num":32,"title":"The One-Hour Rule","events":["Priya wakes to her weekday clinic alarms anyway and decides Sunday will still have structure: one protected hour of BA reading.","Sunita marks Magh Purnima and Guru Ravidas Jayanti with a simple diya by the tulsi pot while the lane stays unusually quiet.","Sana warns Priya about bandh-related tension in Lucknow (Hazratganj side), and Priya chooses to stay home and keep her plan.","Priya uses the label sticker sheet to ‘name’ her study time, reads from 11 to 12, underlines unfamiliar words, and sends Sana a photo as proof.","Light evening rain arrives, and Priya ends the day by typing a short note and sticking a small ‘FEB’ label on her folder."],"facts_introduced":["Feb 1 aligns with Magh Purnima and Guru Ravidas Jayanti; the household marks it quietly with one diya.","Priya formalizes a Sunday 11:00–12:00 ‘one-hour rule’ for BA study, mirroring her 15-minute typing discipline.","Sana reports bandh-related unrest in Lucknow (Hazratganj), influencing Priya to avoid unnecessary travel.","Priya uses sticker labels not only for drawers and files but also to label time and habits.","Ambient national news: Union Budget coverage runs on TV through the day, and Priya hears repeated talk of forms and simplification.","Weather texture (Lucknow region): partly cloudy winter day with a chance of very light rain toward evening/night; temperatures around ~25°C/~11°C.","Priya turns intimidating reading lists into smaller checklists (two pages, five word meanings), making study feel doable."],"open_hooks":["Can Priya protect a weekly study hour as clinic work and household needs continue to tug at her time?","Will bandh/protest disruptions spill into Mohanlalganj’s routines or Priya’s commute in the coming week?","Will this first ‘proof’ of studying become a sustainable BA rhythm rather than a one-day win?"],"recap":"On February 1, Sunday threatens to dissolve into news noise and bandh talk, but Priya insists on one small boundary: an hour of reading. With a diya lit quietly for Magh Purnima and Ravidas Jayanti, she labels her notebook, sits down at eleven, and turns unfamiliar pages into underlines and a short list. When a light rain taps the tin shade in the evening, she adds a new label—FEB—and feels February begin not with drama, but with time kept."}
{"date":"2026-02-02","day_num":33,"title":"The Damp Register","events":["After light winter rain, Priya wakes to her two alarms and heads out to a damp, quieter lane.","At the bus stand, Chai Uncle reads a newspaper mention of World Wetlands Day (2 February), and Priya thinks of the canal-side water and birds on her commute.","Monday’s clinic queue is heavy; damp slips smudge ink, and Priya asks for digits to be repeated rather than guessing.","The desk woman gives Priya a new February register to start; Priya writes a clean heading and adds a small ‘FEB’ label, earning a rare, practical approval.","A printer jam worsens with moisture, but Priya clears it calmly and even saves a rain-soaked prescription by blotting it and weighing it briefly.","After her ₹300 pay, Priya returns home, writes down ‘wetland’ with a Hindi gloss, and keeps her strict fifteen-minute practice."],"facts_introduced":["Feb 2 is World Wetlands Day, observed internationally to highlight wetlands and water ecosystems.","A light winter rain leaves Mohanlalganj’s lane damp, pressing down dust and changing the morning’s feel.","Damp paper makes ink blur; Priya learns to blot wet prescriptions with a clean sheet and flatten them under a weight for a minute or two.","The clinic begins a fresh February 2026 register, and Priya is trusted to write the heading without corrections.","Priya uses sticker labels to organize not only her own folder/time but also a work object (the clinic register).","Priya ties a global word (‘wetland’) to local sights (canal water, white birds) and starts keeping small vocabulary notes.","Priya maintains her routine boundaries on a workday: one phone check, then back to the queue; fifteen minutes of practice at home."],"open_hooks":["Will Priya’s neat organizing habits earn her more responsibility at the clinic beyond registrations?","Can she protect the Sunday one-hour study rule once weekdays become more crowded and tiring?"],"recap":"On February 2, yesterday’s rain clings to everything—puddles at the bus stand, damp edges of paper, and a cautious slowness in traffic. A newspaper line about World Wetlands Day gives Priya a new word, and the clinic gives her a new register: February begins in ink and sticker labels. Between smudged digits and a stubborn printer, Priya holds to what she has learned—don’t guess, don’t rush—and goes home with a small bridge in her notebook: wetland, translated into a thing she can see."}
{"date":"2026-02-03","day_num":34,"title":"The Ten Letters","events":["Tuesday begins with Rakesh returning from a warehouse night shift and Priya leaning on her now-familiar routine: folder, two pens, and the bus stand.","Chai Uncle mentions World Cancer Day being tomorrow (Feb 4), the kind of headline that turns into clinic posters.","At the canal-road clinic, the desk woman introduces a date stamp for patient slips; Priya learns the right pressure for a clean, readable stamp.","Midday, the desk woman asks for Priya’s PAN number (not just the receipt), making Priya feel briefly behind.","Priya messages Sharma Ji during a lull and goes to his cyber shop after the shift to check the application status.","Sharma Ji confirms Priya’s PAN is allotted; he prints the e-PAN and makes photocopies, warning her not to share the number by message.","At home, Priya files the copies, labels the folder privately, completes her strict fifteen-minute practice, and lets the day settle into quiet."] ,"facts_introduced":["The clinic uses a physical date stamp and ink pad to mark patient slips as proof and to reduce disputes when papers are lost.","Priya learns stamp technique: one clean press, straight placement, and enough ink without bleeding.","World Cancer Day is observed on 4 February and shows up in everyday conversation as ‘poster’ news.","Priya’s PAN is allotted by Feb 3; she prints an e-PAN sheet at Sharma Ji’s shop.","A PAN appears as a 10-character code (letters and numbers), more like an identity key than a phone number.","A practical privacy rule lands: don’t send PAN details over casual messages; keep paper copies in the folder.","Season texture: early-February Lucknow-side mornings can be cool and hazy, with afternoons warming quickly."] ,"open_hooks":["Will Priya submit the PAN copy/number to the clinic file, and will that change how ‘official’ her job becomes?","As she proves reliable with stamps and files, will the desk woman hand Priya more administrative responsibility beyond registrations?","Will World Cancer Day posters or awareness activities touch the clinic’s routine tomorrow in a small, local way?"] ,"recap":"On February 3, Priya’s Tuesday is made of tiny official sounds: the thud of a date stamp, the hum of the printer, and the quiet pressure of being asked for a number she doesn’t yet have. When the clinic wants her PAN—not just a receipt—she carries the worry to Sharma Ji’s shop and comes back with ten characters on warm paper, photocopied into safety. By night, the number sits inside her folder like a key she doesn’t need to show anyone, and the day ends the way she prefers: practice timed, papers flat, and a small settling in the chest."}
