{"date":"2026-01-01","day_num":1,"title":"The Fog and the Milk Run","events":["On a dense, cold New Year morning in Mohanlalganj, Priya steps out to buy two milk packets.","UPI payment fails due to network; she pays cash from a folded stash in her notebook.","She warms her hands at Chai Uncle’s stall, exchanges small New Year wishes, and brings chai home.","A voice note from Sana reminds her the BA form deadline is near, stirring the familiar paperwork/fees knot.","Rakesh returns from a night warehouse shift; the household automatically softens its volume and settles around hot tea."],"facts_introduced":["Priya keeps a squared-page notebook for lists/planning and tucks emergency cash inside a separate notebook.","Morning fog in early January strongly shapes the lane’s sounds and distances.","Network/UPI unreliability is a routine friction point in Priya’s errands.","Sana is actively monitoring deadlines and nudges Priya about college forms.","Priya habitually sets aside tea for her father when he returns from night shifts.","Arjun’s New Year greeting is lazy but sincere; household affection is understated."],"open_hooks":["Will Priya manage the BA form/fee/print requirements before the deadline?","A small arc of Priya seeking more stability may begin with this paperwork step."],"recap":"On the first morning of 2026, Priya walks through thick winter fog to buy milk, pauses for ginger chai, and returns to a house waking in layers. A failed UPI payment and Sana’s urgent voice note about college forms add small, familiar pressure, but the day ends with the quiet relief of Rakesh coming home from a night shift and everyone settling around tea."}
{"date":"2026-01-02","day_num":2,"title":"The Photocopy File","events":["Priya decides not to delay and heads out to get her BA form documents printed and photocopied.","She stops for chai; Chai Uncle nudges her to go early before the shop gets crowded and cranky.","At Sharma Ji’s cyber/photocopy shop, slow network, a moody printer, and a brief flicker of power cut stretch a simple task.","Irfan appears to print a ticket; they share quiet company while waiting.","Priya gets fresh photos taken nearby, returns to staple/attach documents, and comes home with the packet organized.","Rakesh signs where needed and says he’ll arrange the fee money after the next shift; Priya updates her checklist."],"facts_introduced":["Priya keeps her academic documents in a plastic folder and treats it with careful, almost protective attention.","Sharma Ji’s shop can be slowed by patchy network, minor power flickers, and a temperamental printer.","A small photo studio near the market lane can produce fresh passport photos quickly for forms.","Irfan occasionally uses the cyber shop for practical errands (printing tickets) and is a calm presence.","Rakesh is willing to sign required declarations and plans to arrange the BA fee after an upcoming shift.","Priya manages anxiety by turning tasks into written checklists in her squared-page notebook."],"open_hooks":["Will Priya be able to pay the fee and submit the BA form on time?","Will the renewed push to continue her BA lead to steadier work or new responsibilities?"],"recap":"On January 2, Priya turns Sana’s deadline warning into action, trekking through the waking market lane for photocopies, printouts, and fresh photos. A slow network and a fussy printer stretch her patience, but shared small talk and quiet company make the wait feel lighter. She returns home with the papers in order, gets Rakesh’s signature, and ends the day with a shorter, clearer list."}
