{"date": "2026-01-01", "day_num": 1, "title": "The Fog and the Milk Run", "events": ["On a dense, cold New Year morning in Mohanlalganj, Priya steps out to buy two milk packets.", "UPI payment fails due to network; she pays cash from a folded stash in her notebook.", "She warms her hands at Chai Uncle’s stall, exchanges small New Year wishes, and brings chai home.", "A voice note from Sana reminds her the BA form deadline is near, stirring the familiar paperwork/fees knot.", "Rakesh returns from a night warehouse shift; the household automatically softens its volume and settles around hot tea."], "facts_introduced": ["Priya keeps a squared-page notebook for lists/planning and tucks emergency cash inside a separate notebook.", "Morning fog in early January strongly shapes the lane’s sounds and distances.", "Network/UPI unreliability is a routine friction point in Priya’s errands.", "Sana is actively monitoring deadlines and nudges Priya about college forms.", "Priya habitually sets aside tea for her father when he returns from night shifts.", "Arjun’s New Year greeting is lazy but sincere; household affection is understated."], "open_hooks": ["Will Priya manage the BA form/fee/print requirements before the deadline?", "A small arc of Priya seeking more stability may begin with this paperwork step."], "recap": "On the first morning of 2026, Priya walks through thick winter fog to buy milk, pauses for ginger chai, and returns to a house waking in layers. A failed UPI payment and Sana’s urgent voice note about college forms add small, familiar pressure, but the day ends with the quiet relief of Rakesh coming home from a night shift and everyone settling around tea."}
{"date": "2026-01-02", "day_num": 2, "title": "The Photocopy File", "events": ["Priya decides not to delay and heads out to get her BA form documents printed and photocopied.", "She stops for chai; Chai Uncle nudges her to go early before the shop gets crowded and cranky.", "At Sharma Ji’s cyber/photocopy shop, slow network, a moody printer, and a brief flicker of power cut stretch a simple task.", "Irfan appears to print a ticket; they share quiet company while waiting.", "Priya gets fresh photos taken nearby, returns to staple/attach documents, and comes home with the packet organized.", "Rakesh signs where needed and says he’ll arrange the fee money after the next shift; Priya updates her checklist."], "facts_introduced": ["Priya keeps her academic documents in a plastic folder and treats it with careful, almost protective attention.", "Sharma Ji’s shop can be slowed by patchy network, minor power flickers, and a temperamental printer.", "A small photo studio near the market lane can produce fresh passport photos quickly for forms.", "Irfan occasionally uses the cyber shop for practical errands (printing tickets) and is a calm presence.", "Rakesh is willing to sign required declarations and plans to arrange the BA fee after an upcoming shift.", "Priya manages anxiety by turning tasks into written checklists in her squared-page notebook."], "open_hooks": ["Will Priya be able to pay the fee and submit the BA form on time?", "Will the renewed push to continue her BA lead to steadier work or new responsibilities?"], "recap": "On January 2, Priya turns Sana’s deadline warning into action, trekking through the waking market lane for photocopies, printouts, and fresh photos. A slow network and a fussy printer stretch her patience, but shared small talk and quiet company make the wait feel lighter. She returns home with the papers in order, gets Rakesh’s signature, and ends the day with a shorter, clearer list."}
{"date": "2026-01-03", "day_num": 3, "title": "The Stamp and the Token", "events": ["Rakesh returns from his night shift and quietly leaves money for Priya’s BA form fee; Sunita urges her to go on the first Saturday while the bank is open.", "Priya tucks the cash in an envelope, carries her plastic folder and checklist notebook, and stops for ginger chai before the queue.", "At the Mohanlalganj bank, she joins the first-Saturday line, gets token 27 from the guard, and waits through the slow choreography of counters and beeps.", "She deposits the fee in cash and receives a purple-stamped receipt, which immediately relieves her tight, waiting anxiety.", "Priya takes the stamped receipt to Sharma Ji, who uploads the submission (slow network, as always) and prints an acknowledgement.", "Back home, Priya files the receipt safely, ticks ‘Fee paid + receipt’ in her notebook, and leaves tea by Rakesh’s bed as the day settles."], "facts_introduced": ["On Jan 3, Priya successfully pays the BA fee at the local bank and gets a stamped receipt.", "The bank uses a token system (Priya receives token 27) and feels crowded on the first Saturday.", "A stamped receipt functions like emotional proof—relief through paperwork.", "Sharma Ji can upload submissions and print acknowledgements for college forms when provided proof of payment.", "Priya keeps fee receipts and acknowledgements together in the plastic folder, stored on the shelf above the trunk.", "Priya expresses care through small acts (leaving tea for her sleeping father rather than waking him)."], "open_hooks": ["Will Priya receive a confirmation/next step from the college after submission?", "Will the push to continue her BA translate into a steadier routine (or new financial strain) for the family?"], "recap": "On January 3, the BA form stops being an anxious future task and becomes a morning of queues, tokens, and paperwork. Rakesh’s quiet support and Sunita’s practical urgency send Priya to the bank on the first Saturday, where token 27 and a purple stamp finally turn effort into proof. With the receipt uploaded and an acknowledgement printed at Sharma Ji’s shop, she returns home to file everything safely, tick a neat checkbox, and let the day end in the soft relief of something properly done."}
{"date": "2026-01-04", "day_num": 4, "title": "Raised Dots", "events": ["On a quiet Sunday morning, Priya waits for a pending portal confirmation after yesterday’s BA fee submission and tries not to refresh her phone too often.", "She goes to Sharma Ji’s cyber shop to check application status, but the site is slow and uncooperative; she prints an extra acknowledgement page as backup proof.", "A small ‘World Braille Day — Jan 4’ poster in the shop leads Priya into a conversation with Irfan about reading raised dots with fingertips.", "At the chemist she notices Braille on a cough lozenge box and, at home, shows the raised dots to Sunita and Arjun; Rakesh offers a quiet line about ‘many alphabets.’", "As evening fog returns, Priya adds a next-step note in her squared notebook—wait a day or two, then ask for help if confirmation doesn’t come—and files the papers back on the shelf."], "facts_introduced": ["Jan 4 is a slower Sunday with winter sun and returning evening fog in Mohanlalganj.", "The college portal can be sluggish/unresponsive on Sunday; Priya cannot get a fresh confirmation yet.", "Priya prints and keeps an extra copy of the submission acknowledgement as a backup.", "A ‘World Braille Day — Jan 4’ poster appears in Sharma Ji’s shop, prompting Priya’s first focused curiosity about Braille.", "Priya notices Braille (raised dots) on medicine packaging at the chemist and shares the tactile detail with her family.", "Priya plans follow-up pragmatically: if no confirmation by Tuesday, she will ask Sharma Ji to help check/call."], "open_hooks": ["When will Priya receive official confirmation/next steps for her BA submission?", "Will Priya’s growing attention to ‘codes’ and systems (forms, networks, Braille) nudge her toward learning something new for stability?"], "recap": "January 4 moves at Sunday pace: Priya tries to see a final ‘confirmed’ message, but the portal refuses to cooperate. At Sharma Ji’s shop she settles for an extra printed acknowledgement, then discovers World Braille Day through a poster and the tiny raised dots on a medicine box. By evening, she files her papers, writes a simple follow-up plan, and lets the day end in fog and small, tactile proof."}
{"date": "2026-01-05", "day_num": 5, "title": "Home Row", "events": ["On a cold Monday morning, Priya goes to Sharma Ji’s cyber shop to check her BA submission status.", "The portal finally shows ‘Payment received. Application under review.’; Priya prints the status page as fresh proof.", "Priya notices the raised bumps on the F and J keys and learns they mark the ‘home row’ for touch typing.", "Irfan encourages her; Sharma Ji grudgingly offers to show her basic typing when the shop is empty.", "At home, Priya writes a small plan: practice typing for fifteen minutes, three days this week, alongside waiting for final confirmation.", "Rakesh leaves for his warehouse shift in the evening; Priya sends him off with tea and the quiet news that she wants to learn."], "facts_introduced": ["On Jan 5, Priya sees her BA application status update to ‘Payment received. Application under review.’", "Priya prints the status page as an additional piece of proof, alongside her receipt and acknowledgement.", "Priya notices the tactile bumps on the F and J keys and learns they anchor touch typing’s home-row position.", "Sharma Ji is willing to teach Priya basic typing in short sessions when the shop is not busy.", "Priya makes a concrete weekly plan for typing practice (15 minutes, three days a week).", "Priya is beginning to connect tactile ‘codes’ (Braille, keyboard markers) with possibilities for steadier work."], "open_hooks": ["When will Priya receive the final ‘confirmed’ message and next steps from the college?", "Will Priya’s typing practice become a real skill that changes her work options and daily routine?"], "recap": "On January 5, Priya’s waiting turns into something she can hold: the portal finally shows her fee is received and her application is under review, and she prints the line as proof. In Sharma Ji’s shop, two tiny bumps on a keyboard lead her to the idea of touch typing—another way of reading and writing with fingertips. By evening she has not received the final confirmation, but she has made a small plan, and that feels like steadier ground."}
{"date": "2026-01-06", "day_num": 6, "title": "Fifteen Minutes", "events": ["On a foggy Tuesday morning after Rakesh returns from a night shift, the household slips into its quiet rhythm while tea is made.", "Priya times her visit to Sharma Ji’s shop for when it’s half-open and not crowded, going for her promised first typing lesson.", "Sharma Ji drills her on the home row (A-S-D-F / J-K-L-;) and insists she keep her eyes on the screen; Priya learns to use backspace and to keep going through mistakes.", "Sharma Ji gives her a small home-row practice printout; Priya buys coriander on the way back.", "A short power cut in the afternoon turns the house still; Priya ‘practises’ on her thigh with the printed sheet.", "In the evening she ticks ‘Typing practice: Day 1 (15 minutes)’ in her notebook and checks the portal once—still under review, but it feels less tight."], "facts_introduced": ["On Jan 6, Priya completes her first official typing practice session: 15 minutes at Sharma Ji’s shop.", "Sharma Ji uses a simple home-row drill (A-S-D-F and J-K-L-;) and insists on not looking at the keyboard.", "Priya learns to treat mistakes as normal and uses the backspace key as part of practice.", "Sharma Ji provides a small printed ‘Home Row Practice’ sheet for at-home drills.", "A brief daytime power cut (about twenty minutes) is normal enough to be routine.", "Priya stores the typing practice sheet inside her plastic folder, treating the new skill like a document worth protecting.", "Priya begins checking the college portal less compulsively; the status remains ‘under review.’"], "open_hooks": ["When will Priya receive final confirmation/next steps for the BA application?", "Will she follow through on her plan to practise typing three days this week—and will it start changing her work options?"], "recap": "On January 6, Priya gives herself a new kind of proof: fifteen minutes of typing practice at Sharma Ji’s shop. The day is ordinary—fog, tea, a brief power cut—but her small tick in the notebook feels like forward motion even while the college portal stays ‘under review.’"}
{"date": "2026-01-07", "day_num": 7, "title": "Key Pressure", "events": ["In thick winter fog, Priya wakes with the new habit of feeling for the F/J bumps even under her blanket.", "Over chai, Rakesh encourages her to learn but teases her about pressing the keys too hard; Arjun makes fun and then tries the drills himself.", "Priya returns to Sharma Ji’s shop for her second 15-minute typing session and focuses on cleaner, slower home-row work.", "Sharma Ji introduces simple pattern practice (as/df and jk/kl) and scribbles a small list for Priya to practise at home.", "Priya buys potatoes and a little matar (peas) for Sunita on the way back, noticing her own ID photo sheet ghosting in the studio window.", "At night she ticks ‘Typing practice: Day 2 (15 minutes)’ and adds a new home-practice note; the BA portal remains ‘under review,’ but sits more quietly in her mind."], "facts_introduced": ["On Jan 7, Priya completes typing practice Day 2 (15 minutes) at Sharma Ji’s shop.", "Sharma Ji emphasizes ‘slow is fast’ and asks Priya to aim for cleaner home-row accuracy.", "Priya begins basic pattern drills beyond straight lines of letters (as/df and jk/kl).", "Sharma Ji scribbles a short pattern list on scrap paper for at-home practice.", "Priya adds a second checklist line: home practice for the new patterns.", "Priya buys potatoes and a small amount of matar (peas) as part of the day’s errands.", "The BA application status remains ‘under review’ on Jan 7; Priya checks once and lets it be."], "open_hooks": ["When will the BA application move from ‘under review’ to confirmed/next steps?", "Will Priya maintain her three-days-a-week typing plan—and start practising at home consistently?"], "recap": "On January 7, Priya’s new skill becomes less like an idea and more like routine: she returns for day two of typing practice, learns to go slower and cleaner, and carries a scrap of pattern drills home like another important document. The college portal still refuses to give her final confirmation, but the waiting no longer takes up the whole room."}
{"date": "2026-01-08", "day_num": 8, "title": "Name on the Screen", "events": ["On a slightly clearer winter morning, Priya rehearses the home-row pattern on her knee while the household moves quietly around Rakesh sleeping after a night shift.", "At the bus stand, Chai Uncle encourages her with a proverb-like reassurance about ‘educated fingers.’", "Sharma Ji’s cyber shop is extra crowded on Thursday with people doing form work; Priya waits with her folder on her lap.", "Irfan arrives for a practical errand; he quietly encourages Priya not to stop at day three.", "When the crowd thins, Priya completes her third 15-minute typing session; Sharma Ji makes her type her name and she sees it appear on the screen as a new kind of proof.", "A brief power flicker happens during practice; Sharma Ji tells her to continue and treat interruptions as part of the lesson.", "Sharma Ji assigns a small home routine: type ‘Priya Verma’ five times plus pattern repetitions; Priya records it as an un-ticked checkbox in her notebook.", "The BA portal remains ‘under review’ when she checks once at night, but the day ends with calmer hands and a steadier sense of forward motion."], "facts_introduced": ["Thursdays tend to be busier at Sharma Ji’s cyber/photocopy shop due to form-related crowds.", "On Jan 8, Priya completes typing practice Day 3 (15 minutes).", "Sharma Ji has Priya type her full name (‘Priya Verma’) as a simple real-word typing exercise.", "A short power flicker can occur during shop hours; practice sometimes continues through it if power holds.", "Priya begins a home typing assignment routine (name repetitions plus as/df and jk/kl patterns), tracked as checkbox tasks in her squared notebook.", "Irfan frames ‘day three’ as a common stopping point, offering quiet encouragement to continue.", "Priya buys a small biscuit packet for Arjun as a minor peace/affection gesture.", "BA application status remains ‘under review’ on Jan 8; Priya checks once and sets it aside."], "open_hooks": ["When will Priya’s BA application move from ‘under review’ to a final confirmation / next steps?", "Will Priya follow through on home practice and keep the typing habit beyond the initial three-day plan?", "Could typing lead to steadier work opportunities through Sharma Ji’s shop or other local needs?"], "recap": "On January 8, Priya reaches the third day of her small typing plan: a day when people often stop, Irfan observes, but she doesn’t. After waiting through a crowded Thursday at Sharma Ji’s shop, she types her own name on the screen and feels a new kind of seriousness settle in her hands. The college portal is still under review, yet the day ends with a tick in her notebook and a gentler confidence that she can keep going."}
{"date":"2026-01-09","day_num":9,"title":"Borrowed Warmth","events":["A cold-wave school closure quiets the lane; Arjun prepares for hybrid class at home while Rakesh sleeps after a night shift.","Priya tries to practice typing at home without a keyboard and decides to go to Sharma Ji’s shop just for ten minutes of ‘borrowed warmth.’","At the chai stall, Chai Uncle jokes that the fog is behaving like a landlord and urges her to sit on the keyboard and learn anyway.","At the cyber shop, Priya practices her name and home-row patterns; Sharma Ji then asks her to type a handwritten customer list cleanly.","Priya types the list carefully, treating names as serious; Sharma Ji prints it and pays her ₹50, calling it real work, not charity.","At home, Priya shows Sunita the ₹50; Sunita tells her to keep it safe and not wake Rakesh with the news.","Arjun, trying to stay present on a shaky connection, loudly tells his teacher ‘network issue’ while Priya laughs softly.","That night the BA portal still reads ‘Application under review,’ but it pinches less; Priya ends the day with the calming thought: work is work."],"facts_introduced":["On Jan 9 a cold-wave-related school closure affects the day’s rhythm; Arjun has hybrid/online class expectations.","Priya practices typing even outside the planned three-day rhythm, sometimes in shorter (10-minute) sessions.","Chai Uncle describes the fog as ‘behaving like a landlord,’ reinforcing winter’s clamp on movement.","Sharma Ji gives Priya a first small paid typing task: cleaning up a handwritten list (names and mobile numbers) into a neat printout.","Sharma Ji pays Priya ₹50 for the typed list and frames it as work, not charity.","Priya tucks small earnings into her notebook like a recorded fact.","Sunita advises Priya not to tell Rakesh immediately so he doesn’t worry and can sleep after his night shift.","The BA application status remains ‘under review’ on Jan 9; Priya checks once and lets it sit."],"open_hooks":["Will Sharma Ji begin calling Priya for more small typing jobs—and can it grow into steadier income?","When will Priya’s BA application move from ‘under review’ to final confirmation/next steps?","How will Arjun’s school disruptions (cold-wave closures, hybrid classes) affect the household routine and expenses?"] ,"recap":"A cold-wave closure makes Mohanlalganj feel muffled and slow, but Priya uses the quiet to keep her new habit alive. She goes to Sharma Ji’s shop just to practice, and ends up typing a real list for a customer—small, paid work that makes her learning feel sturdier. The BA portal is still under review by night, yet her hands hold a new proof: work is work."}
{"date":"2026-01-10","day_num":10,"title":"Status Bar","events":["Very dense fog hangs over Mohanlalganj; the household moves around Rakesh sleeping after a late night shift.","Sana sends a voice note urging Priya to keep typing and not obsess over the BA portal status.","At the chai stall, Chai Uncle shows a forwarded IMD warning about very dense fog and cold wave conditions.","Priya practices typing for fifteen minutes at Sharma Ji’s shop and is given a new task: typing a Hindi complaint letter for an uncle to submit at the electricity office.","Priya struggles with the Hindi keyboard layout but completes the letter cleanly; Sharma Ji pays her ₹60 and warns her to be careful with people’s words.","At home, Sunita quietly praises her (‘Shabaash’) and Priya records the earnings in her notebook.","That evening, the BA portal still reads ‘Application under review,’ but it feels more like background noise than a threat."],"facts_introduced":["On Jan 10, Priya completes another typing session (15 minutes) beyond her original three-days-a-week plan.","Priya types a Hindi complaint letter (for the electricity office) on Sharma Ji’s computer and learns that Hindi typing uses a different layout.","Sharma Ji pays Priya ₹60 for the Hindi typing job, framing it as harder work than English typing.","IMD fog/cold-wave warnings enter the household’s awareness via forwarded messages, influencing how people time their errands.","Priya is increasingly treating her phone’s status messages (‘under review’) as information, not a verdict.","Sunita gives quiet praise and continues to manage what news reaches Rakesh when he is exhausted after shifts."],"open_hooks":["Will Priya be offered more regular typing work (including Hindi) through Sharma Ji’s shop?","When will the BA application finally move from ‘under review’ to confirmed/next steps?","Will Priya’s small earnings shift household conversations about stability and studying?"],"recap":"January 10 arrives with very dense fog and a new kind of forward motion. Priya takes Sana’s blunt encouragement, borrows warmth at Sharma Ji’s shop, and turns practice into another paid task—this time a Hindi complaint letter that forces her to learn a different keyboard. The college portal stays ‘under review,’ but the status no longer fills the whole day."}
{"date": "2026-01-11", "day_num": 11, "title": "Rubber Stamp", "events": ["On a Sunday with thinner fog, the family airs quilts on the roof and keeps quiet around Rakesh sleeping after a night shift.", "Sunita begins melting jaggery to make til (sesame) laddoos ahead of Makar Sankranti.", "Priya stops at Chai Uncle’s stall, where fog/cold-wave warnings are again discussed as forwarded phone messages.", "She slips into Sharma Ji’s half-open shop for a short practice session; he adds ‘space bar’ to her drills.", "Priya asks about buying a keyboard; Sharma Ji estimates ₹300–₹400 for a USB keyboard and warns that phone typing isn’t the same.", "In the market lane she finds a second-hand keyboard quoted at ₹250 but decides not to buy yet.", "At home Priya creates a ‘KEYBOARD’ envelope and starts a small fund with ₹50, storing it behind her plastic folder.", "A portal notification arrives but is only a generic reminder to keep the acknowledgement; Priya laughs and chooses practice over refreshing the status."], "facts_introduced": ["Sunday is used for airing quilts/blankets on the roof to pull dampness out in winter.", "Sunita starts preparing til laddoos ahead of Makar Sankranti (still a few days away).", "Priya begins considering home practice equipment and asks about buying a USB keyboard.", "Sharma Ji quotes an estimated ₹300–₹400 for a basic USB keyboard and notes phone typing differs.", "In the market lane, a second-hand keyboard is offered for ₹250 but with sticky keys.", "Priya starts a dedicated ‘keyboard fund’ envelope with ₹50 and stores it near her document folder.", "Priya practices in a short session even on Sunday, adding ‘space bar’ awareness as part of typing skill.", "The college portal sends a generic notification reminding her to keep the acknowledgement for future reference; the application remains under review."], "open_hooks": ["Will Priya manage to save enough to buy a keyboard and begin more consistent home practice?", "When will the BA application move from ‘under review’ to final confirmation/next steps?", "Will small earnings and the keyboard plan shift how Priya talks to the family about work and stability?"], "recap": "January 11 is a quiet Sunday: quilts air on the roof, jaggery melts for sesame laddoos, and fog warnings circulate like routine gossip. Priya sneaks in a short typing practice, asks about buying a keyboard, and—after seeing a second-hand one she can’t yet afford—starts a small ‘KEYBOARD’ fund with ₹50. The portal’s message offers no new verdict, but she ends the day choosing steady practice over anxious refreshing."}
{"date": "2026-01-12", "day_num": 12, "title": "Utho, Jago", "events": ["Fog thins in the morning; Priya starts the day with household quiet around Rakesh sleeping after a night shift.", "Arjun gets a school chart assignment for National Youth Day (Vivekananda Jayanti); Priya helps pick and print a Vivekananda quote.", "At Sharma Ji’s shop, Priya types the quote herself on the computer in front of customers, focusing on spaces and accuracy.", "Sharma Ji asks her to type another handwritten Hindi list (names/dates); she works carefully with the Hindi keyboard layout.", "Sharma Ji pays Priya ₹70 for the Hindi typing job.", "At home, Priya adds the ₹70 to her KEYBOARD fund, taking it from ₹50 to ₹120, and helps Sunita roll til laddoos.", "The cold sharpens again by evening; Priya checks the BA portal once—still ‘under review’—and chooses practice over worrying."], "facts_introduced": ["Jan 12 is observed as National Youth Day (Vivekananda Jayanti) and becomes a school assignment prompt for Arjun.", "Priya types an English quote for Arjun’s chart at Sharma Ji’s shop, practicing typing in a public/busy setting.", "Priya completes another paid Hindi typing task (a handwritten list) and is paid ₹70.", "Priya’s KEYBOARD fund increases to ₹120 after adding the ₹70 earnings.", "UP weather pattern shifts: fog thins in the morning; colder north-westerly sharpness returns by evening (ambient).", "Priya continues to treat portal status (‘under review’) as background information rather than a verdict.", "Sunita continues Makar Sankranti preparations by making til laddoos with Priya’s help."], "open_hooks": ["When will the BA application move from under review to final confirmation/next steps?", "Will Priya save enough to buy a keyboard and begin consistent home practice?", "Will paid Hindi typing work become more regular through Sharma Ji’s shop?"], "recap": "On January 12, the fog lifts enough for the lane to look honest again, and Priya turns her new habit into something public: she types a Vivekananda quote for Arjun’s school chart and then carefully types a Hindi list for a customer at Sharma Ji’s shop, earning ₹70. At home she adds it to her keyboard fund—now ₹120—rolls sesame laddoos with Sunita, and lets the BA portal’s ‘under review’ sit quietly in the background as the evening cold returns."}
{"date": "2026-01-13", "day_num": 13, "title": "Without a Screen", "events": ["On a sharp, foggy eve of Makar Sankranti, Sunita continues sesame/jaggery preparations while the household moves gently around winter and Rakesh’s sleep cycles.", "Priya practices typing in Sharma Ji’s crowded shop and is trusted with typing a distribution list of customer names and phone numbers.", "Irfan notices Priya working and offers quiet, non-hovering support that steadies her.", "Sharma Ji pays Priya ₹50 for careful work; Priya updates her KEYBOARD fund to ₹170 and tracks the remaining ₹80.", "Priya visits the market lane’s second-hand keyboard seller, negotiates lightly, and decides to return after the festival once she has the full amount.", "A small lane-side bonfire (with Lohri as distant ambience) mirrors Priya’s ‘borrowed warmth’ theme; she checks the BA portal once—still under review—and chooses practice over refreshing."], "facts_introduced": ["Jan 13 is the eve of Makar Sankranti in Mohanlalganj; household preparations include til laddoos and a khichdi ingredient plate set aside for morning.", "Priya completes a paid English typing task: converting a handwritten customer/distribution list (names + mobile numbers) into a neat printout.", "Sharma Ji pays Priya ₹50 for the distribution list work, emphasizing care with spelling/names.", "Priya’s KEYBOARD fund increases from ₹120 to ₹170 on Jan 13; she identifies ₹80 remaining to reach ₹250.", "The second-hand keyboard in the market lane remains priced at ₹250; Priya asks the seller to hold it and plans to return after the festival.", "Irfan continues to be a quiet supportive presence, noticing Priya’s progress without making it performative.", "Winter ambience: fog persists; warmth is sought through chai stalls and occasional small bonfires in the lane."], "open_hooks": ["Will Priya manage to buy the ₹250 keyboard soon and start consistent home practice?", "Will Sharma Ji begin offering Priya more regular paid typing work?", "When will the BA application move from ‘under review’ to final confirmation/next steps?"], "recap": "On January 13, the eve of Sankranti, Priya’s new habit turns more practical: she practices in a crowded cyber shop and is trusted with typing a careful distribution list, earning ₹50 and pushing her keyboard fund to ₹170. She visits the second-hand keyboard seller again, decides to wait until after the festival to buy, and ends the day warmed by chai and a small bonfire—checking the BA portal only once, letting ‘under review’ sit quietly behind the steadier work of her hands."}
{"date":"2026-01-14","day_num":14,"title":"The Kite String","events":["On Makar Sankranti, the household keeps its volume low around Rakesh’s post-night-shift sleep while Sunita cooks khichdi and finishes til laddoos.","Kites cut through thinning fog; Arjun is intent on winning a roof-top kite battle.","Priya runs a small errand via the bus stand, where Chai Uncle offers festival laddoo and jokes about her ‘fights’ with paperwork and network.","Sharma Ji calls Priya in for a quick urgent typing job (a khichdi distribution list); Priya completes it carefully and earns exactly ₹80.","Priya’s KEYBOARD fund reaches ₹250—enough to buy the second-hand keyboard after the festival.","On the roof, Priya gets a portal update: BA application status becomes ‘Approved’ with instruction to download/print a confirmation slip; she chooses not to refresh and waits for the right moment to tell Sunita."],"facts_introduced":["Makar Sankranti in 2026 falls on Jan 14 and is marked locally with khichdi, til-gud sweets, and kite flying.","Priya receives ₹80 for an urgent typing job and reaches her target of ₹250 saved for a second-hand keyboard.","Sharma Ji sometimes calls Priya on festival days for time-sensitive typing work before closing.","Priya’s BA application status changes from ‘under review’ to ‘Approved’ on Jan 14, with a confirmation slip to download/print.","Priya is learning to treat status updates as facts without compulsive refreshing.","Kite-flying on nearby roofs is a strong Sankranti texture in the lane.","The household maintains quiet during the day to protect Rakesh’s night-shift sleep, even on festival days."],"open_hooks":["Will Priya buy the second-hand keyboard and start consistent home practice?","Will printing the BA confirmation slip lead to next steps (admit card, attendance/fees) and new pressures?","Will Sharma Ji’s ‘quick urgent jobs’ become a more regular income stream for Priya?"],"recap":"Makar Sankranti arrives with shy sun and kite cries over a lane still holding fog in its corners. Between khichdi, til-gud, and keeping the house quiet for Rakesh’s sleep, Priya sneaks in a small errand that turns into paid work: an urgent typed distribution list that finally completes her keyboard fund. Later, with the kite string humming in her hand, her phone quietly changes its verdict—her BA application is approved—two small proofs settling into the day like warmth."}
{"date":"2026-01-15","day_num":15,"title":"The Confirmation Slip","events":["The post-festival morning is quiet and foggy; Priya resolves to turn ‘Approved’ into a printed confirmation slip.","At Sharma Ji’s shop, she logs into the portal, downloads and prints two copies of her BA confirmation slip, and files them in her plastic folder.","Ambient news mentions Army Day (Jan 15) and widespread fog; forwarded IMD-style warnings circulate at the bus stand.","Priya uses her ₹250 KEYBOARD fund to buy the second-hand keyboard from the market lane seller and brings it home wrapped in newspaper.","At home she cleans the keyboard, tests the F/J bumps, and practices typing her name without a screen, feeling a new kind of steadiness."],"facts_introduced":["On Jan 15, Priya downloads and prints her BA confirmation slip after the status changes to ‘Approved’.","Priya prints (and keeps) two copies of the confirmation slip, treating duplicates as practical protection.","Priya buys a second-hand USB keyboard for ₹250 and brings it home wrapped in newspaper.","The keyboard’s tactile F/J home-row bumps matter to Priya as anchor points for practice.","Priya begins at-home typing practice by using the keyboard even without a screen, focusing on muscle memory and sound.","Army Day (Jan 15) appears as ambient radio/news texture during errands.","Very dense fog/cold-wave warnings circulate socially via forwarded messages, shaping how errands are timed."],"open_hooks":["Will Priya connect the keyboard to a device soon (phone/OTG or a borrowed laptop) to practice with real feedback?","Will printing the confirmation slip trigger new next steps (admit card, attendance/fees) and fresh pressures?","Will Sharma Ji’s paid typing work become more regular now that Priya can practice at home?"],"recap":"On January 15, the day after Sankranti, Priya turns a quiet phone notification into paper: she goes to Sharma Ji’s shop, downloads her BA confirmation slip, and prints two copies to file safely. With her keyboard fund complete, she buys a second-hand keyboard and brings it home like a careful new utensil, wiping the keys and practicing her name by sound and touch. The fog and forwarded warnings continue outside, but inside the day leaves her with two small proofs—one printed, one in her hands."}
{"date": "2026-01-16", "day_num": 16, "title": "The Small Connector", "events": ["An orange-level fog warning and thick winter cold shape the morning’s rhythm in Mohanlalganj.", "Priya brings her new second-hand USB keyboard to Sharma Ji and buys an OTG adapter for ₹60 to connect it to her phone.", "The keyboard successfully connects; Priya sees her typed letters appear on her own screen for the first time.", "At home she starts a strict 15-minute practice session with visual feedback using a typing practice site.", "When Sana sends a voice note, Priya replies by typing a short message and sends it without over-editing."], "facts_introduced": ["IMD-style ‘orange’ alert for very dense fog is discussed as ambience; fog affects travel and shift timing.", "Priya buys an OTG (on-the-go) adapter from Sharma Ji for ₹60.", "Priya’s phone supports a physical keyboard connection; a ‘Physical keyboard connected’ message appears.", "Priya begins practicing typing with real-time on-screen feedback using her phone + keyboard.", "Priya follows a 15-minute practice timer and stops even when she wants to continue.", "Priya starts sending typed WhatsApp messages (not only voice notes) to Sana.", "Sunita accepts the small spend after a pause, ‘adjusting an internal budget.’"], "open_hooks": ["Will Priya keep the daily 15-minute at-home typing habit now that she has feedback?", "Will typed messaging change her confidence and how she participates in school/college-related coordination with Sana?", "Will more paid typing work appear now that Priya can practice consistently at home?"], "recap": "January 16 arrives wrapped in cold and an orange-level fog warning, but Priya’s attention is on a smaller weather of her own: the click of keys. With a ₹60 OTG adapter from Sharma Ji, her second-hand keyboard finally speaks to her phone, and her practice begins to answer back in visible letters. By afternoon she keeps a strict fifteen-minute routine and sends Sana a typed reply without shrinking it through edits—small proof that her hands are learning to be direct."}
{"date":"2026-01-17","day_num":17,"title":"The Thumbs-Up","events":["Rakesh returns from a night shift before dawn; the household moves in winter hush under dense fog.","Priya keeps her 15-minute at-home typing practice routine with phone + keyboard, then runs a small vegetable errand.","A warehouse WhatsApp group message about fog delays wakes Rakesh; he struggles to type a reply on the phone.","Priya connects her keyboard to Rakesh’s phone and types a clear message to his supervisor; the thumbs-up reply steadies the morning.","Sana visits in the afternoon with notes; they study together, and Arjun proudly turns Priya’s typing into ‘news.’"],"facts_introduced":["Priya uses her keyboard for a real household task: typing a workplace message for Rakesh.","Rakesh is in a warehouse WhatsApp group where fog delays/shift timing are coordinated.","Priya can connect her keyboard (via OTG) to another phone, not just her own.","Sunita respects Priya’s 15-minute timer once she sees it as serious practice.","Sana and Priya set an in-person study time (4 pm) to work through BA material.","Sana corrects Priya’s English gently during study, keeping it practical.","Arjun sends a voice note bragging that Priya types ‘like an office,’ spreading her progress socially.","Dense fog continues to disrupt transport timing; people discuss train/bus delays as everyday winter talk."],"open_hooks":["Will Priya’s typing skill start getting pulled into more ‘serious’ family tasks (forms, letters, work messages), changing expectations?","Will Sana’s study visits become a steady routine now that Priya’s BA approval is real?","Will Priya’s growing usefulness at home lead to more paid typing work—or less time for herself?"],"recap":"On a foggy Saturday, Priya keeps her new fifteen-minute practice promise and then finds a real test for it: her father’s warehouse group pings about delays, and his tired thumbs can’t shape a clean reply. Priya plugs in her keyboard, types the message, and watches it return as a simple thumbs-up—small relief settling into the courtyard like weak winter sun. By afternoon Sana arrives with notes, and Priya’s quiet progress has already become gossip through Arjun’s proud voice note."}
